zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/eadc_reg.h
/**************************************************************************//**
 * @file     eadc_reg.h
 * @version  V1.00
 * @brief    EADC register definition header file
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/

#ifndef __EADC_REG_H__
#define __EADC_REG_H__

#if defined ( __CC_ARM   )
    #pragma anon_unions
#endif

/**
    @addtogroup REGISTER Control Register
    @{
*/

/**
    @addtogroup EADC Enhanced Analog to Digital Converter (EADC)
    Memory Mapped Structure for EADC Controller
    @{
*/

typedef struct
{


    /**
     * @var EADC_T::DAT[19]
     * Offset: 0x00/0x04/0x08/0x0C/0x10/0x14/0x18/0x1C/0x20/0x24/0x28/0x2C/0x30/0x34/0x38/0x3C/0x40/0x44/0x48  EADC Data Register 0~18 for Sample Module 0~18
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |RESULT    |EADC Conversion Result
     * |        |          |This field contains 12 bits conversion result.
     * |        |          |The 12-bit EADC conversion result with unsigned format will be filled in RESULT[11:0] and zero will be filled in RESULT[15:12].
     * |        |          |Note: When operating in oversampling mode, RESULT[15:0] can represent oversampling results.
     * |[16]    |OV        |Overrun Flag
     * |        |          |If converted data in RESULT[11:0] has not been read before new conversion result is loaded to this register, OV is set to 1.
     * |        |          |0 = Data in RESULT[11:0] is recent conversion result.
     * |        |          |1 = Data in RESULT[11:0] is overwrite.
     * |        |          |Note: It is cleared by hardware after EADC_DAT register is read.
     * |[17]    |VALID     |Valid Flag
     * |        |          |This bit is set to 1 when corresponding sample module channel analog input conversion is completed and cleared by hardware after EADC_DAT register is read.
     * |        |          |0 = Data in RESULT[11:0] bits is not valid.
     * |        |          |1 = Data in RESULT[11:0] bits is valid.
     * @var EADC_T::CURDAT
     * Offset: 0x4C  EADC PDMA Current Transfer Data Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[27:0]  |CURDAT    |EADC PDMA Current Transfer Data
     * |        |          |This register is a shadow register of EADC_DATn (n=0~27) for PDMA support.
     * |        |          |Note: These bits are read only.
     * @var EADC_T::CTL
     * Offset: 0x50  EADC Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ADCEN     |EADC Converter Enable Bit
     * |        |          |0 = EADC Disabled.
     * |        |          |1 = EADC Enabled.
     * |        |          |Note: Before starting EADC conversion function, this bit should be set to 1
     * |        |          |Clear it to 0 to disable EADC converter analog circuit power consumption.
     * |[1]     |ADCRST    |EADC Converter Control Circuits Reset
     * |        |          |0 = No effect.
     * |        |          |1 = Cause EADC control circuits reset to initial state, but not change the EADC registers value.
     * |        |          |Note: ADCRST bit remains 1 during EADC reset, when EADC reset end, the ADCRST bit is automatically cleared to 0.
     * |[2]     |ADCIEN0   |Specific Sample Module EADC ADINT0 Interrupt Enable Bit
     * |        |          |The EADC converter generates a conversion end ADIF0 (EADC_STATUS2[0]) upon the end of specific sample module EADC conversion
     * |        |          |If ADCIEN0 bit is set then conversion end interrupt request ADINT0 is generated.
     * |        |          |0 = Specific sample module EADC ADINT0 interrupt function Disabled.
     * |        |          |1 = Specific sample module EADC ADINT0 interrupt function Enabled.
     * |[3]     |ADCIEN1   |Specific Sample Module EADC ADINT1 Interrupt Enable Bit
     * |        |          |The EADC converter generates a conversion end ADIF1 (EADC_STATUS2[1]) upon the end of specific sample module EADC conversion
     * |        |          |If EADCIEN1 bit is set then conversion end interrupt request ADINT1 is generated.
     * |        |          |0 = Specific sample module EADC ADINT1 interrupt function Disabled.
     * |        |          |1 = Specific sample module EADC ADINT1 interrupt function Enabled.
     * |[4]     |ADCIEN2   |Specific Sample Module EADC ADINT2 Interrupt Enable Bit
     * |        |          |The EADC converter generates a conversion end ADIF2 (EADC_STATUS2[2]) upon the end of specific sample module EADC conversion
     * |        |          |If EADCIEN2 bit is set then conversion end interrupt request ADINT2 is generated.
     * |        |          |0 = Specific sample module EADC ADINT2 interrupt function Disabled.
     * |        |          |1 = Specific sample module EADC ADINT2 interrupt function Enabled.
     * |[5]     |ADCIEN3   |Specific Sample Module EADC ADINT3 Interrupt Enable Bit
     * |        |          |The EADC converter generates a conversion end ADIF3 (EADC_STATUS2[3]) upon the end of specific sample module EADC conversion
     * |        |          |If EADCIEN3 bit is set then conversion end interrupt request ADINT3 is generated.
     * |        |          |0 = Specific sample module EADC ADINT3 interrupt function Disabled.
     * |        |          |1 = Specific sample module EADC ADINT3 interrupt function Enabled.
     * |[8]     |DIFFEN    |Differential Analog Input Mode Enable Bit
     * |        |          |0 = Single-end analog input mode.
     * |        |          |1 = Differential analog input mode.
     * |        |          |Note: In the differential mode, the input channel pair must be configured to EADC_CHx, EADC_CHx+1 , x=0,2,4,6,8,10,12,14.
     * |[9]     |DMOF      |ADC Differential Input Mode Output Format
     * |        |          |0 = ADC conversion result will be filled in RESULT (EADC_DATn[15:0], where n= 0 ~27) with unsigned format.
     * |        |          |1 = ADC conversion result will be filled in RESULT (EADC_DATn[15:0], where n= 0 ~27) with 2'complement format.
     * |[19:16] |INTDEL0   |ADC Start Of Conversion ADINT0 Delay Cycle Selection
     * |        |          |Start of conversion interrupt ADINT0 will delay INTDEL0 PCLK cycles to generate interrupt
     * |        |          |The function support delay 1 PCLK to 15 PCLK cycles, user can select one of the options according to the relationship of PCLK and ADC _CLK which user selected.
     * |        |          |4'h0 = No delay cycle.
     * |        |          |4'h1 = Start of conversion interrupt ADINT0 delay 1 PCLK cycle.
     * |        |          |4'h2 = Start of conversion interrupt ADINT0 delay 2 PCLK cycles.
     * |        |          |4'h3 = Start of conversion interrupt ADINT0 delay 3 PCLK cycles.
     * |        |          |4'h4 = Start of conversion interrupt ADINT0 delay 4 PCLK cycles.
     * |        |          |4'h5 = Start of conversion interrupt ADINT0 delay 5 PCLK cycles.
     * |        |          |4'h6 = Start of conversion interrupt ADINT0 delay 6 PCLK cycles.
     * |        |          |4'h7 = Start of conversion interrupt ADINT0 delay 7 PCLK cycles.
     * |        |          |4'h8 = Start of conversion interrupt ADINT0 delay 8 PCLK cycles.
     * |        |          |4'h9 = Start of conversion interrupt ADINT0 delay 9 PCLK cycles.
     * |        |          |4'ha = Start of conversion interrupt ADINT0 delay 10 PCLK cycles.
     * |        |          |4'hb = Start of conversion interrupt ADINT0 delay 11 PCLK cycles.
     * |        |          |4'hc = Start of conversion interrupt ADINT0 delay 12 PCLK cycles.
     * |        |          |4'hd = Start of conversion interrupt ADINT0 delay 13 PCLK cycles.
     * |        |          |4'he = Start of conversion interrupt ADINT0 delay 14 PCLK cycles.
     * |        |          |4'hf = Start of conversion interrupt ADINT0 delay 15 PCLK cycles.
     * |        |          |Note: This function is workable only when any one of INTPOS (EADC_SCTLx[5]), x=0~15 is set.
     * |        |          |Note: It is noted that the delayed interrupt ADINT0 must occurs before the next ADINT0 generated when use the same sample module to control EADC conversion.
     * |[23:20] |INTDEL1   |ADC Start Of Conversion ADINT1 Delay Cycle Selection
     * |        |          |Start of conversion interrupt ADINT1 will delay INTDEL1 PCLK cycles to generate interrupt
     * |        |          |The function support delay 1 PCLK to 15 PCLK cycles, user can select one of the options according to the relationship of PCLK and ADC _CLK which user selected.
     * |        |          |4'h0 = No delay cycle.
     * |        |          |4'h1 = Start of conversion interrupt ADINT1 delay 1 PCLK cycle.
     * |        |          |4'h2 = Start of conversion interrupt ADINT1 delay 2 PCLK cycles.
     * |        |          |4'h3 = Start of conversion interrupt ADINT1 delay 3 PCLK cycles.
     * |        |          |4'h4 = Start of conversion interrupt ADINT1 delay 4 PCLK cycles.
     * |        |          |4'h5 = Start of conversion interrupt ADINT1 delay 5 PCLK cycles.
     * |        |          |4'h6 = Start of conversion interrupt ADINT1 delay 6 PCLK cycles.
     * |        |          |4'h7 = Start of conversion interrupt ADINT1 delay 7 PCLK cycles.
     * |        |          |4'h8 = Start of conversion interrupt ADINT1 delay 8 PCLK cycles.
     * |        |          |4'h9 = Start of conversion interrupt ADINT1 delay 9 PCLK cycles.
     * |        |          |4'ha = Start of conversion interrupt ADINT1 delay 10 PCLK cycles.
     * |        |          |4'hb = Start of conversion interrupt ADINT1 delay 11 PCLK cycles.
     * |        |          |4'hc = Start of conversion interrupt ADINT1 delay 12 PCLK cycles.
     * |        |          |4'hd = Start of conversion interrupt ADINT1 delay 13 PCLK cycles.
     * |        |          |4'he = Start of conversion interrupt ADINT1 delay 14 PCLK cycles.
     * |        |          |4'hf = Start of conversion interrupt ADINT1 delay 15 PCLK cycles.
     * |        |          |Note: This function is workable only when any one of INTPOS (EADC_SCTLx[5]), x=0~15 is set.
     * |        |          |Note: It is noted that the delayed interrupt ADINT1 must occurs before the next ADINT1 generated when use the same sample module to control EADC conversion.
     * |[27:24] |INTDEL2   |ADC Start Of Conversion ADINT2 Delay Cycle Selection
     * |        |          |Start of conversion interrupt ADINT2 will delay INTDEL2 PCLK cycles to generate interrupt
     * |        |          |The function support delay 1 PCLK to 15 PCLK cycles, user can select one of the options according to the relationship of PCLK and ADC _CLK which user which user selected.
     * |        |          |4'h0 = No delay cycle.
     * |        |          |4'h1 = Start of conversion interrupt ADINT2 delay 1 PCLK cycle.
     * |        |          |4'h2 = Start of conversion interrupt ADINT2 delay 2 PCLK cycles.
     * |        |          |4'h3 = Start of conversion interrupt ADINT2 delay 3 PCLK cycles.
     * |        |          |4'h4 = Start of conversion interrupt ADINT2 delay 4 PCLK cycles.
     * |        |          |4'h5 = Start of conversion interrupt ADINT2 delay 5 PCLK cycles.
     * |        |          |4'h6 = Start of conversion interrupt ADINT2 delay 6 PCLK cycles.
     * |        |          |4'h7 = Start of conversion interrupt ADINT2 delay 7 PCLK cycles.
     * |        |          |4'h8 = Start of conversion interrupt ADINT2 delay 8 PCLK cycles.
     * |        |          |4'h9 = Start of conversion interrupt ADINT2 delay 9 PCLK cycles.
     * |        |          |4'ha = Start of conversion interrupt ADINT2 delay 10 PCLK cycles.
     * |        |          |4'hb = Start of conversion interrupt ADINT2 delay 11 PCLK cycles.
     * |        |          |4'hc = Start of conversion interrupt ADINT2 delay 12 PCLK cycles.
     * |        |          |4'hd = Start of conversion interrupt ADINT2 delay 13 PCLK cycles.
     * |        |          |4'he = Start of conversion interrupt ADINT2 delay 14 PCLK cycles.
     * |        |          |4'hf = Start of conversion interrupt ADINT2 delay 15 PCLK cycles.
     * |        |          |Note: This function is workable only when any one of INTPOS (EADC_SCTLx[5]), x=0~15 is set.
     * |        |          |Note: It is noted that the delayed interrupt ADINT2 must occurs before the next ADINT2 generated when use the same sample module to control EADC conversion.
     * |[31:28] |INTDEL3   |ADC Start Of Conversion ADINT3 Delay Cycle Selection
     * |        |          |Start of conversion interrupt ADINT3 will delay INTDEL3 PCLK cycles to generate interrupt
     * |        |          |The function support delay 1 PCLK to 15 PCLK cycles, user can select one of the options according to the relationship of PCLK and ADC _CLK which user selected.
     * |        |          |4'h0 = No delay cycle.
     * |        |          |4'h1 = Start of conversion interrupt ADINT3 delay 1 PCLK cycle.
     * |        |          |4'h2 = Start of conversion interrupt ADINT3 delay 2 PCLK cycles.
     * |        |          |4'h3 = Start of conversion interrupt ADINT3 delay 3 PCLK cycles.
     * |        |          |4'h4 = Start of conversion interrupt ADINT3 delay 4 PCLK cycles.
     * |        |          |4'h5 = Start of conversion interrupt ADINT3 delay 5 PCLK cycles.
     * |        |          |4'h6 = Start of conversion interrupt ADINT3 delay 6 PCLK cycles.
     * |        |          |4'h7 = Start of conversion interrupt ADINT3 delay 7 PCLK cycles.
     * |        |          |4'h8 = Start of conversion interrupt ADINT3 delay 8 PCLK cycles.
     * |        |          |4'h9 = Start of conversion interrupt ADINT3 delay 9 PCLK cycles.
     * |        |          |4'ha = Start of conversion interrupt ADINT3 delay 10 PCLK cycles.
     * |        |          |4'hb = Start of conversion interrupt ADINT3 delay 11 PCLK cycles.
     * |        |          |4'hc = Start of conversion interrupt ADINT3 delay 12 PCLK cycles.
     * |        |          |4'hd = Start of conversion interrupt ADINT3 delay 13 PCLK cycles.
     * |        |          |4'he = Start of conversion interrupt ADINT3 delay 14 PCLK cycles.
     * |        |          |4'hf = Start of conversion interrupt ADINT3 delay 15 PCLK cycles.
     * |        |          |Note: This function is workable only when any one of INTPOS (EADC_SCTLx[5]), x=0~15 is set.
     * |        |          |Note: It is noted that the delayed interrupt ADINT3 must occurs before the next ADINT3 generated when use the same sample module to control EADC conversion.
     * @var EADC_T::SWTRG
     * Offset: 0x54  EADC Sample Module Software Start Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[27:0]  |SWTRG     |EADC Sample Module 0~27 Software Force to Start EADC Conversion
     * |        |          |0 = No effect.
     * |        |          |1 = Cause an EADC conversion when the priority is given to sample module.
     * |        |          |Note: After writing this register to start EADC conversion, the EADC_PENDSTS register will show which sample module will conversion
     * |        |          |If user want to disable the conversion of the sample module, user can write EADC_PENDSTS register to clear it.
     * @var EADC_T::PENDSTS
     * Offset: 0x58  EADC Start of Conversion Pending Flag Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[27:0]  |STPF      |EADC Sample Module 0~27 Start of Conversion Pending Flag
     * |        |          |Read Operation:
     * |        |          |0 = There is no pending conversion for sample module.
     * |        |          |1 = Sample module EADC start of conversion is pending.
     * |        |          |Write Operation:
     * |        |          |1 = Clear pending flag & cancel the conversion for sample module.
     * |        |          |Note: This bit remains 1 during pending state, when the respective EADC conversion is end, the STPFn (n=0~27) bit is automatically cleared to 0
     * @var EADC_T::OVSTS
     * Offset: 0x5C  EADC Sample Module Start of Conversion Overrun Flag Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[27:0]  |SPOVF     |EADC SAMPLE0~27 Overrun Flag
     * |        |          |0 = No sample module event overrun.
     * |        |          |1 = Indicates a new sample module event is generated while an old one event is pending.
     * |        |          |Note: This bit is cleared by writing 1 to it.
     * @var EADC_T::CTL1
     * Offset: 0x60  EADC Control1 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |PRECHEN   |Precharge Enable Bit
     * |        |          |0 = Channel precharge Disabled.
     * |        |          |1 = Channel precharge Enabled.
     * |        |          |Note: Analog input voltage is 1/2 VREF when PRECHEN and DISCHEN are all enable.
     * |[1]     |DISCHEN   |Discharge Enable Bit
     * |        |          |0 = Channel discharge Disabled.
     * |        |          |1 = Channel discharge Enabled.
     * |        |          |Note: Analog input voltage is 1/2 VREF when PRECHEN and DISCHEN are all enable.
     * |[5:4]   |RESSEL    |Resolution Select Bits
     * |        |          |00 = ADC resolution 12 bits.
     * |        |          |01 = ADC resolution 10 bits.
     * |        |          |10 = ADC resolution 8 bits.
     * |        |          |11 = Reserved.
     * |[8]     |FDETCHEN  |Floating Detect Channel Enable Bit
     * |        |          |0 = Floating Detect Channel Disabled.
     * |        |          |1 = Floating Detect Channel Enabled.
     * |[20]    |CMP0TRG   |ADC Comparator 0 Trigger EPWM Brake Enable Bit
     * |        |          |0 = Comparator 0 trigger EPWM brake is disabled.
     * |        |          |1 = Comparator 0 trigger EPWM brake is enabled.
     * |[21]    |CMP1TRG   |ADC Comparator 1 Trigger EPWM Brake Enable Bit
     * |        |          |0 = Comparator 1 trigger EPWM brake is disabled.
     * |        |          |1 = Comparator 1 trigger EPWM brake is enabled.
     * |[22]    |CMP2TRG   |ADC Comparator 2 Trigger EPWM Brake Enable Bit
     * |        |          |0 = Comparator 2 trigger EPWM brake is disabled.
     * |        |          |1 = Comparator 2 trigger EPWM brake is enabled.
     * |[23]    |CMP3TRG   |ADC Comparator 3 Trigger EPWM Brake Enable Bit
     * |        |          |0 = Comparator 3 trigger EPWM brake is disabled.
     * |        |          |1 = Comparator 3 trigger EPWM brake is enabled.
     * @var EADC_T::SCTL[19]
     * Offset: 0x80/0x84/0x88/0x8C/0x90/0x94/0x98/0x9C/0xA0/0xA4/0xA8/0xAC/0xB0/0xB4/0xB8/0xBC/0xC0/0xC4/0xC8  EADC Sample Module 0~18 Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[4:0]   |CHSEL     |EADC Sample Module Channel Selection
     * |        |          |00H = EADC_CH0.
     * |        |          |01H = EADC_CH1.
     * |        |          |02H = EADC_CH2.
     * |        |          |03H = EADC_CH3.
     * |        |          |04H = EADC_CH4.
     * |        |          |05H = EADC_CH5.
     * |        |          |06H = EADC_CH6.
     * |        |          |07H = EADC_CH7.
     * |        |          |08H = EADC_CH8.
     * |        |          |09H = EADC_CH9.
     * |        |          |0AH = EADC_CH10.
     * |        |          |0BH = EADC_CH11.
     * |        |          |0CH = EADC_CH12.
     * |        |          |0DH = EADC_CH13.
     * |        |          |0EH = EADC_CH14.
     * |        |          |0FH = EADC_CH15.
     * |        |          |10H = EADC_CH16.
     * |        |          |11H = EADC_CH17.
     * |        |          |12H = EADC_CH18.
     * |        |          |13H = EADC_CH19.
     * |        |          |14H = EADC_CH20.
     * |        |          |15H = EADC_CH21.
     * |        |          |16H = EADC_CH22.
     * |        |          |17H = EADC_CH23.
     * |        |          |Others = Reserved.
     * |[5]     |INTPOS    |Interrupt Flag Position Select
     * |        |          |0 = Set ADIFn (EADC_STATUS2[n], n=0~3) at EADC end of conversion.
     * |        |          |1 = Set ADIFn (EADC_STATUS2[n], n=0~3) at EADC start of conversion.
     * |[7:6]   |TRGDLDIV  |EADC Sample Module Start of Conversion Trigger Delay Clock Divider Selection
     * |        |          |Trigger delay clock frequency:
     * |        |          |00 = EADC_CLK/1.
     * |        |          |01 = EADC_CLK/2.
     * |        |          |10 = EADC_CLK/4.
     * |        |          |11 = EADC_CLK/16.
     * |[15:8]  |TRGDLCNT  |EADC Sample Module Start of Conversion Trigger Delay Time
     * |        |          |Trigger delay time = TRGDLCNT x EADC_CLK period x n (n=1,2,4,16 from TRGDLDIV setting).
     * |[21:16] |TRGSEL    |EADC Sample Module Start of Conversion Trigger Source Selection
     * |        |          |0H = Disable trigger.
     * |        |          |1H = External trigger from EADC0_ST pin input.
     * |        |          |2H = EADC ADINT0 interrupt EOC pulse trigger.
     * |        |          |3H = EADC ADINT1 interrupt EOC pulse trigger.
     * |        |          |4H = Timer0 overflow pulse trigger.
     * |        |          |5H = Timer1 overflow pulse trigger.
     * |        |          |6H = Timer2 overflow pulse trigger.
     * |        |          |7H = Timer3 overflow pulse trigger.
     * |        |          |8H = EPWM0TG0.
     * |        |          |9H = EPWM0TG1.
     * |        |          |AH = EPWM0TG2.
     * |        |          |BH = EPWM0TG3.
     * |        |          |CH = EPWM0TG4.
     * |        |          |DH = EPWM0TG5.
     * |        |          |EH = EPWM1TG0.
     * |        |          |FH = EPWM1TG1.
     * |        |          |10H = EPWM1TG2.
     * |        |          |11H = EPWM1TG3.
     * |        |          |12H = EPWM1TG4.
     * |        |          |13H = EPWM1TG5.
     * |        |          |20H = BPWM0TG.
     * |        |          |21H = BPWM1TG.
     * |        |          |22H = ACMP0_INT.
     * |        |          |23H = ACMP1_INT.
     * |        |          |24H = ACMP2_INT.
     * |        |          |25H = ACMP3_INT.
     * |        |          |other = Reserved.
     * |[22]    |EXTREN    |EADC External Trigger Rising Edge Enable Bit
     * |        |          |0 = Rising edge Disabled when EADC selects EADC_ST as trigger source.
     * |        |          |1 = Rising edge Enabled when EADC selects EADC_ST as trigger source.
     * |[23]    |EXTFEN    |EADC External Trigger Falling Edge Enable Bit
     * |        |          |0 = Falling edge Disabled when EADC selects EADC_ST as trigger source.
     * |        |          |1 = Falling edge Enabled when EADC selects EADC_ST as trigger source.
