zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/eadc_reg.h
#define EADC_OVSTS_SPOVF_Pos             (0)                                               /*!< EADC_T::OVSTS: SPOVF Position          */
#define EADC_OVSTS_SPOVF_Msk             (0xffffffful << EADC_OVSTS_SPOVF_Pos)             /*!< EADC_T::OVSTS: SPOVF Mask              */

#define EADC_CTL1_PRECHEN_Pos            (0)                                               /*!< EADC_T::CTL1: PRECHEN Position         */
#define EADC_CTL1_PRECHEN_Msk            (0x1ul << EADC_CTL1_PRECHEN_Pos)                  /*!< EADC_T::CTL1: PRECHEN Mask             */

#define EADC_CTL1_DISCHEN_Pos            (1)                                               /*!< EADC_T::CTL1: DISCHEN Position         */
#define EADC_CTL1_DISCHEN_Msk            (0x1ul << EADC_CTL1_DISCHEN_Pos)                  /*!< EADC_T::CTL1: DISCHEN Mask             */

#define EADC_CTL1_RESSEL_Pos             (4)                                               /*!< EADC_T::CTL1: RESSEL Position          */
#define EADC_CTL1_RESSEL_Msk             (0x3ul << EADC_CTL1_RESSEL_Pos)                   /*!< EADC_T::CTL1: RESSEL Mask              */

#define EADC_CTL1_FDETCHEN_Pos           (8)                                               /*!< EADC_T::CTL1: FDETCHEN Position        */
#define EADC_CTL1_FDETCHEN_Msk           (0x1ul << EADC_CTL1_FDETCHEN_Pos)                 /*!< EADC_T::CTL1: FDETCHEN Mask            */

#define EADC_CTL1_CMP0TRG_Pos           (20)                                               /*!< EADC_T::CTL1: CMP0TRG Position         */
#define EADC_CTL1_CMP0TRG_Msk           (0x1ul << EADC_CTL1_CMP0TRG_Pos)                   /*!< EADC_T::CTL1: CMP0TRG Mask             */

#define EADC_CTL1_CMP1TRG_Pos           (21)                                               /*!< EADC_T::CTL1: CMP1TRG Position         */
#define EADC_CTL1_CMP1TRG_Msk           (0x1ul << EADC_CTL1_CMP1TRG_Pos)                   /*!< EADC_T::CTL1: CMP1TRG Mask             */

#define EADC_CTL1_CMP2TRG_Pos           (22)                                               /*!< EADC_T::CTL1: CMP2TRG Position         */
#define EADC_CTL1_CMP2TRG_Msk           (0x1ul << EADC_CTL1_CMP2TRG_Pos)                   /*!< EADC_T::CTL1: CMP2TRG Mask             */

#define EADC_CTL1_CMP3TRG_Pos            (23)                                              /*!< EADC_T::CTL1: CMP3TRG Position         */
#define EADC_CTL1_CMP3TRG_Msk            (0x1ul << EADC_CTL1_CMP3TRG_Pos)                  /*!< EADC_T::CTL1: CMP3TRG Mask             */

#define EADC_SCTL_CHSEL_Pos             (0)                                                /*!< EADC_T::SCTL: CHSEL Position           */
#define EADC_SCTL_CHSEL_Msk             (0x1ful << EADC_SCTL_CHSEL_Pos)                    /*!< EADC_T::SCTL: CHSEL Mask               */

#define EADC_SCTL_INTPOS_Pos            (5)                                                /*!< EADC_T::SCTL: INTPOS Position          */
#define EADC_SCTL_INTPOS_Msk            (0x1ul << EADC_SCTL_INTPOS_Pos)                    /*!< EADC_T::SCTL: INTPOS Mask              */

#define EADC_SCTL_TRGDLDIV_Pos          (6)                                                /*!< EADC_T::SCTL: TRGDLDIV Position        */
#define EADC_SCTL_TRGDLDIV_Msk          (0x3ul << EADC_SCTL_TRGDLDIV_Pos)                  /*!< EADC_T::SCTL: TRGDLYDIV Mask           */

#define EADC_SCTL_TRGDLCNT_Pos          (8)                                                /*!< EADC_T::SCTL: TRGDLCNT Position        */
#define EADC_SCTL_TRGDLCNT_Msk          (0xfful << EADC_SCTL_TRGDLCNT_Pos)                 /*!< EADC_T::SCTL: TRGDLYCNT Mask           */

#define EADC_SCTL_TRGSEL_Pos            (16)                                               /*!< EADC_T::SCTL: TRGSEL Position          */
#define EADC_SCTL_TRGSEL_Msk            (0x3ful << EADC_SCTL_TRGSEL_Pos)                   /*!< EADC_T::SCTL: TRGSEL Mask              */

#define EADC_SCTL_EXTREN_Pos            (22)                                               /*!< EADC_T::SCTL: EXTREN Position          */
#define EADC_SCTL_EXTREN_Msk            (0x1ul << EADC_SCTL_EXTREN_Pos)                    /*!< EADC_T::SCTL: EXTREN Mask              */

#define EADC_SCTL_EXTFEN_Pos            (23)                                               /*!< EADC_T::SCTL: EXTFEN Position          */
#define EADC_SCTL_EXTFEN_Msk            (0x1ul << EADC_SCTL_EXTFEN_Pos)                    /*!< EADC_T::SCTL: EXTFEN Mask              */

#define EADC_SCTL_EXTSMPT_Pos           (24)                                               /*!< EADC_T::SCTL: EXTSMPT Position         */
#define EADC_SCTL_EXTSMPT_Msk           (0xfful << EADC_SCTL_EXTSMPT_Pos)                  /*!< EADC_T::SCTL: EXTSMPT Mask             */

#define EADC_SCTL0_CHSEL_Pos             (0)                                               /*!< EADC_T::SCTL0: CHSEL Position          */
#define EADC_SCTL0_CHSEL_Msk             (0x1ful << EADC_SCTL0_CHSEL_Pos)                  /*!< EADC_T::SCTL0: CHSEL Mask              */

#define EADC_SCTL0_INTPOS_Pos            (5)                                               /*!< EADC_T::SCTL0: INTPOS Position         */
#define EADC_SCTL0_INTPOS_Msk            (0x1ul << EADC_SCTL0_INTPOS_Pos)                  /*!< EADC_T::SCTL0: INTPOS Mask             */

#define EADC_SCTL0_TRGDLDIV_Pos          (6)                                               /*!< EADC_T::SCTL0: TRGDLDIV Position       */
#define EADC_SCTL0_TRGDLDIV_Msk          (0x3ul << EADC_SCTL0_TRGDLDIV_Pos)                /*!< EADC_T::SCTL0: TRGDLDIV Mask           */

#define EADC_SCTL0_TRGDLCNT_Pos          (8)                                               /*!< EADC_T::SCTL0: TRGDLCNT Position       */
#define EADC_SCTL0_TRGDLCNT_Msk          (0xfful << EADC_SCTL0_TRGDLCNT_Pos)               /*!< EADC_T::SCTL0: TRGDLCNT Mask           */

#define EADC_SCTL0_TRGSEL_Pos            (16)                                              /*!< EADC_T::SCTL0: TRGSEL Position         */
#define EADC_SCTL0_TRGSEL_Msk            (0x3ful << EADC_SCTL0_TRGSEL_Pos)                 /*!< EADC_T::SCTL0: TRGSEL Mask             */

#define EADC_SCTL0_EXTREN_Pos            (22)                                              /*!< EADC_T::SCTL0: EXTREN Position         */
#define EADC_SCTL0_EXTREN_Msk            (0x1ul << EADC_SCTL0_EXTREN_Pos)                  /*!< EADC_T::SCTL0: EXTREN Mask             */

#define EADC_SCTL0_EXTFEN_Pos            (23)                                              /*!< EADC_T::SCTL0: EXTFEN Position         */
#define EADC_SCTL0_EXTFEN_Msk            (0x1ul << EADC_SCTL0_EXTFEN_Pos)                  /*!< EADC_T::SCTL0: EXTFEN Mask             */

#define EADC_SCTL0_EXTSMPT_Pos           (24)                                              /*!< EADC_T::SCTL0: EXTSMPT Position        */
#define EADC_SCTL0_EXTSMPT_Msk           (0xfful << EADC_SCTL0_EXTSMPT_Pos)                /*!< EADC_T::SCTL0: EXTSMPT Mask            */

#define EADC_SCTL1_CHSEL_Pos             (0)                                               /*!< EADC_T::SCTL1: CHSEL Position          */
#define EADC_SCTL1_CHSEL_Msk             (0x1ful << EADC_SCTL1_CHSEL_Pos)                  /*!< EADC_T::SCTL1: CHSEL Mask              */

#define EADC_SCTL1_INTPOS_Pos            (5)                                               /*!< EADC_T::SCTL1: INTPOS Position         */
#define EADC_SCTL1_INTPOS_Msk            (0x1ul << EADC_SCTL1_INTPOS_Pos)                  /*!< EADC_T::SCTL1: INTPOS Mask             */

