zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/eadc_reg.h
#define EADC_SCTL1_TRGDLDIV_Pos          (6)                                               /*!< EADC_T::SCTL1: TRGDLDIV Position       */
#define EADC_SCTL1_TRGDLDIV_Msk          (0x3ul << EADC_SCTL1_TRGDLDIV_Pos)                /*!< EADC_T::SCTL1: TRGDLDIV Mask           */

#define EADC_SCTL1_TRGDLCNT_Pos          (8)                                               /*!< EADC_T::SCTL1: TRGDLCNT Position       */
#define EADC_SCTL1_TRGDLCNT_Msk          (0xfful << EADC_SCTL1_TRGDLCNT_Pos)               /*!< EADC_T::SCTL1: TRGDLCNT Mask           */

#define EADC_SCTL1_TRGSEL_Pos            (16)                                              /*!< EADC_T::SCTL1: TRGSEL Position         */
#define EADC_SCTL1_TRGSEL_Msk            (0x3ful << EADC_SCTL1_TRGSEL_Pos)                 /*!< EADC_T::SCTL1: TRGSEL Mask             */

#define EADC_SCTL1_EXTREN_Pos            (22)                                              /*!< EADC_T::SCTL1: EXTREN Position         */
#define EADC_SCTL1_EXTREN_Msk            (0x1ul << EADC_SCTL1_EXTREN_Pos)                  /*!< EADC_T::SCTL1: EXTREN Mask             */

#define EADC_SCTL1_EXTFEN_Pos            (23)                                              /*!< EADC_T::SCTL1: EXTFEN Position         */
#define EADC_SCTL1_EXTFEN_Msk            (0x1ul << EADC_SCTL1_EXTFEN_Pos)                  /*!< EADC_T::SCTL1: EXTFEN Mask             */

#define EADC_SCTL1_EXTSMPT_Pos           (24)                                              /*!< EADC_T::SCTL1: EXTSMPT Position        */
#define EADC_SCTL1_EXTSMPT_Msk           (0xfful << EADC_SCTL1_EXTSMPT_Pos)                /*!< EADC_T::SCTL1: EXTSMPT Mask            */

#define EADC_SCTL2_CHSEL_Pos             (0)                                               /*!< EADC_T::SCTL2: CHSEL Position          */
#define EADC_SCTL2_CHSEL_Msk             (0x1ful << EADC_SCTL2_CHSEL_Pos)                  /*!< EADC_T::SCTL2: CHSEL Mask              */

#define EADC_SCTL2_INTPOS_Pos            (5)                                               /*!< EADC_T::SCTL2: INTPOS Position         */
#define EADC_SCTL2_INTPOS_Msk            (0x1ul << EADC_SCTL2_INTPOS_Pos)                  /*!< EADC_T::SCTL2: INTPOS Mask             */

#define EADC_SCTL2_TRGDLDIV_Pos          (6)                                               /*!< EADC_T::SCTL2: TRGDLDIV Position       */
#define EADC_SCTL2_TRGDLDIV_Msk          (0x3ul << EADC_SCTL2_TRGDLDIV_Pos)                /*!< EADC_T::SCTL2: TRGDLDIV Mask           */

#define EADC_SCTL2_TRGDLCNT_Pos          (8)                                               /*!< EADC_T::SCTL2: TRGDLCNT Position       */
#define EADC_SCTL2_TRGDLCNT_Msk          (0xfful << EADC_SCTL2_TRGDLCNT_Pos)               /*!< EADC_T::SCTL2: TRGDLCNT Mask           */

#define EADC_SCTL2_TRGSEL_Pos            (16)                                              /*!< EADC_T::SCTL2: TRGSEL Position         */
#define EADC_SCTL2_TRGSEL_Msk            (0x3ful << EADC_SCTL2_TRGSEL_Pos)                 /*!< EADC_T::SCTL2: TRGSEL Mask             */

#define EADC_SCTL2_EXTREN_Pos            (22)                                              /*!< EADC_T::SCTL2: EXTREN Position         */
#define EADC_SCTL2_EXTREN_Msk            (0x1ul << EADC_SCTL2_EXTREN_Pos)                  /*!< EADC_T::SCTL2: EXTREN Mask             */

#define EADC_SCTL2_EXTFEN_Pos            (23)                                              /*!< EADC_T::SCTL2: EXTFEN Position         */
#define EADC_SCTL2_EXTFEN_Msk            (0x1ul << EADC_SCTL2_EXTFEN_Pos)                  /*!< EADC_T::SCTL2: EXTFEN Mask             */

#define EADC_SCTL2_EXTSMPT_Pos           (24)                                              /*!< EADC_T::SCTL2: EXTSMPT Position        */
#define EADC_SCTL2_EXTSMPT_Msk           (0xfful << EADC_SCTL2_EXTSMPT_Pos)                /*!< EADC_T::SCTL2: EXTSMPT Mask            */

#define EADC_SCTL3_CHSEL_Pos             (0)                                               /*!< EADC_T::SCTL3: CHSEL Position          */
#define EADC_SCTL3_CHSEL_Msk             (0x1ful << EADC_SCTL3_CHSEL_Pos)                  /*!< EADC_T::SCTL3: CHSEL Mask              */

#define EADC_SCTL3_INTPOS_Pos            (5)                                               /*!< EADC_T::SCTL3: INTPOS Position         */
#define EADC_SCTL3_INTPOS_Msk            (0x1ul << EADC_SCTL3_INTPOS_Pos)                  /*!< EADC_T::SCTL3: INTPOS Mask             */

#define EADC_SCTL3_TRGDLDIV_Pos          (6)                                               /*!< EADC_T::SCTL3: TRGDLDIV Position       */
#define EADC_SCTL3_TRGDLDIV_Msk          (0x3ul << EADC_SCTL3_TRGDLDIV_Pos)                /*!< EADC_T::SCTL3: TRGDLDIV Mask           */

#define EADC_SCTL3_TRGDLCNT_Pos          (8)                                               /*!< EADC_T::SCTL3: TRGDLCNT Position       */
#define EADC_SCTL3_TRGDLCNT_Msk          (0xfful << EADC_SCTL3_TRGDLCNT_Pos)               /*!< EADC_T::SCTL3: TRGDLCNT Mask           */

#define EADC_SCTL3_TRGSEL_Pos            (16)                                              /*!< EADC_T::SCTL3: TRGSEL Position         */
#define EADC_SCTL3_TRGSEL_Msk            (0x3ful << EADC_SCTL3_TRGSEL_Pos)                 /*!< EADC_T::SCTL3: TRGSEL Mask             */

#define EADC_SCTL3_EXTREN_Pos            (22)                                              /*!< EADC_T::SCTL3: EXTREN Position         */
#define EADC_SCTL3_EXTREN_Msk            (0x1ul << EADC_SCTL3_EXTREN_Pos)                  /*!< EADC_T::SCTL3: EXTREN Mask             */

#define EADC_SCTL3_EXTFEN_Pos            (23)                                              /*!< EADC_T::SCTL3: EXTFEN Position         */
#define EADC_SCTL3_EXTFEN_Msk            (0x1ul << EADC_SCTL3_EXTFEN_Pos)                  /*!< EADC_T::SCTL3: EXTFEN Mask             */

#define EADC_SCTL3_EXTSMPT_Pos           (24)                                              /*!< EADC_T::SCTL3: EXTSMPT Position        */
#define EADC_SCTL3_EXTSMPT_Msk           (0xfful << EADC_SCTL3_EXTSMPT_Pos)                /*!< EADC_T::SCTL3: EXTSMPT Mask            */

