zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/eadc_reg.h
#define EADC_SCTL4_CHSEL_Pos             (0)                                               /*!< EADC_T::SCTL4: CHSEL Position          */
#define EADC_SCTL4_CHSEL_Msk             (0x1ful << EADC_SCTL4_CHSEL_Pos)                  /*!< EADC_T::SCTL4: CHSEL Mask              */

#define EADC_SCTL4_INTPOS_Pos            (5)                                               /*!< EADC_T::SCTL4: INTPOS Position         */
#define EADC_SCTL4_INTPOS_Msk            (0x1ul << EADC_SCTL4_INTPOS_Pos)                  /*!< EADC_T::SCTL4: INTPOS Mask             */

#define EADC_SCTL4_TRGDLDIV_Pos          (6)                                               /*!< EADC_T::SCTL4: TRGDLDIV Position       */
#define EADC_SCTL4_TRGDLDIV_Msk          (0x3ul << EADC_SCTL4_TRGDLDIV_Pos)                /*!< EADC_T::SCTL4: TRGDLDIV Mask           */

#define EADC_SCTL4_TRGDLCNT_Pos          (8)                                               /*!< EADC_T::SCTL4: TRGDLCNT Position       */
#define EADC_SCTL4_TRGDLCNT_Msk          (0xfful << EADC_SCTL4_TRGDLCNT_Pos)               /*!< EADC_T::SCTL4: TRGDLCNT Mask           */

#define EADC_SCTL4_TRGSEL_Pos            (16)                                              /*!< EADC_T::SCTL4: TRGSEL Position         */
#define EADC_SCTL4_TRGSEL_Msk            (0x3ful << EADC_SCTL4_TRGSEL_Pos)                 /*!< EADC_T::SCTL4: TRGSEL Mask             */

#define EADC_SCTL4_EXTREN_Pos            (22)                                              /*!< EADC_T::SCTL4: EXTREN Position         */
#define EADC_SCTL4_EXTREN_Msk            (0x1ul << EADC_SCTL4_EXTREN_Pos)                  /*!< EADC_T::SCTL4: EXTREN Mask             */

#define EADC_SCTL4_EXTFEN_Pos            (23)                                              /*!< EADC_T::SCTL4: EXTFEN Position         */
#define EADC_SCTL4_EXTFEN_Msk            (0x1ul << EADC_SCTL4_EXTFEN_Pos)                  /*!< EADC_T::SCTL4: EXTFEN Mask             */

#define EADC_SCTL4_EXTSMPT_Pos           (24)                                              /*!< EADC_T::SCTL4: EXTSMPT Position        */
#define EADC_SCTL4_EXTSMPT_Msk           (0xfful << EADC_SCTL4_EXTSMPT_Pos)                /*!< EADC_T::SCTL4: EXTSMPT Mask            */

#define EADC_SCTL5_CHSEL_Pos             (0)                                               /*!< EADC_T::SCTL5: CHSEL Position          */
#define EADC_SCTL5_CHSEL_Msk             (0x1ful << EADC_SCTL5_CHSEL_Pos)                  /*!< EADC_T::SCTL5: CHSEL Mask              */

#define EADC_SCTL5_INTPOS_Pos            (5)                                               /*!< EADC_T::SCTL5: INTPOS Position         */
#define EADC_SCTL5_INTPOS_Msk            (0x1ul << EADC_SCTL5_INTPOS_Pos)                  /*!< EADC_T::SCTL5: INTPOS Mask             */

#define EADC_SCTL5_TRGDLDIV_Pos          (6)                                               /*!< EADC_T::SCTL5: TRGDLDIV Position       */
#define EADC_SCTL5_TRGDLDIV_Msk          (0x3ul << EADC_SCTL5_TRGDLDIV_Pos)                /*!< EADC_T::SCTL5: TRGDLDIV Mask           */

#define EADC_SCTL5_TRGDLCNT_Pos          (8)                                               /*!< EADC_T::SCTL5: TRGDLCNT Position       */
#define EADC_SCTL5_TRGDLCNT_Msk          (0xfful << EADC_SCTL5_TRGDLCNT_Pos)               /*!< EADC_T::SCTL5: TRGDLCNT Mask           */

#define EADC_SCTL5_TRGSEL_Pos            (16)                                              /*!< EADC_T::SCTL5: TRGSEL Position         */
#define EADC_SCTL5_TRGSEL_Msk            (0x3ful << EADC_SCTL5_TRGSEL_Pos)                 /*!< EADC_T::SCTL5: TRGSEL Mask             */

#define EADC_SCTL5_EXTREN_Pos            (22)                                              /*!< EADC_T::SCTL5: EXTREN Position         */
#define EADC_SCTL5_EXTREN_Msk            (0x1ul << EADC_SCTL5_EXTREN_Pos)                  /*!< EADC_T::SCTL5: EXTREN Mask             */

#define EADC_SCTL5_EXTFEN_Pos            (23)                                              /*!< EADC_T::SCTL5: EXTFEN Position         */
#define EADC_SCTL5_EXTFEN_Msk            (0x1ul << EADC_SCTL5_EXTFEN_Pos)                  /*!< EADC_T::SCTL5: EXTFEN Mask             */

#define EADC_SCTL5_EXTSMPT_Pos           (24)                                              /*!< EADC_T::SCTL5: EXTSMPT Position        */
#define EADC_SCTL5_EXTSMPT_Msk           (0xfful << EADC_SCTL5_EXTSMPT_Pos)                /*!< EADC_T::SCTL5: EXTSMPT Mask            */

#define EADC_SCTL6_CHSEL_Pos             (0)                                               /*!< EADC_T::SCTL6: CHSEL Position          */
#define EADC_SCTL6_CHSEL_Msk             (0x1ful << EADC_SCTL6_CHSEL_Pos)                  /*!< EADC_T::SCTL6: CHSEL Mask              */

#define EADC_SCTL6_INTPOS_Pos            (5)                                               /*!< EADC_T::SCTL6: INTPOS Position         */
#define EADC_SCTL6_INTPOS_Msk            (0x1ul << EADC_SCTL6_INTPOS_Pos)                  /*!< EADC_T::SCTL6: INTPOS Mask             */

#define EADC_SCTL6_TRGDLDIV_Pos          (6)                                               /*!< EADC_T::SCTL6: TRGDLDIV Position       */
#define EADC_SCTL6_TRGDLDIV_Msk          (0x3ul << EADC_SCTL6_TRGDLDIV_Pos)                /*!< EADC_T::SCTL6: TRGDLDIV Mask           */

#define EADC_SCTL6_TRGDLCNT_Pos          (8)                                               /*!< EADC_T::SCTL6: TRGDLCNT Position       */
#define EADC_SCTL6_TRGDLCNT_Msk          (0xfful << EADC_SCTL6_TRGDLCNT_Pos)               /*!< EADC_T::SCTL6: TRGDLCNT Mask           */

#define EADC_SCTL6_TRGSEL_Pos            (16)                                              /*!< EADC_T::SCTL6: TRGSEL Position         */
#define EADC_SCTL6_TRGSEL_Msk            (0x3ful << EADC_SCTL6_TRGSEL_Pos)                 /*!< EADC_T::SCTL6: TRGSEL Mask             */

#define EADC_SCTL6_EXTREN_Pos            (22)                                              /*!< EADC_T::SCTL6: EXTREN Position         */
#define EADC_SCTL6_EXTREN_Msk            (0x1ul << EADC_SCTL6_EXTREN_Pos)                  /*!< EADC_T::SCTL6: EXTREN Mask             */

