zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/eadc_reg.h
#define EADC_SCTL13_TRGDLDIV_Pos         (6)                                               /*!< EADC_T::SCTL13: TRGDLDIV Position      */
#define EADC_SCTL13_TRGDLDIV_Msk         (0x3ul << EADC_SCTL13_TRGDLDIV_Pos)               /*!< EADC_T::SCTL13: TRGDLDIV Mask          */

#define EADC_SCTL13_TRGDLCNT_Pos         (8)                                               /*!< EADC_T::SCTL13: TRGDLCNT Position      */
#define EADC_SCTL13_TRGDLCNT_Msk         (0xfful << EADC_SCTL13_TRGDLCNT_Pos)              /*!< EADC_T::SCTL13: TRGDLCNT Mask          */

#define EADC_SCTL13_TRGSEL_Pos           (16)                                              /*!< EADC_T::SCTL13: TRGSEL Position        */
#define EADC_SCTL13_TRGSEL_Msk           (0x3ful << EADC_SCTL13_TRGSEL_Pos)                /*!< EADC_T::SCTL13: TRGSEL Mask            */

#define EADC_SCTL13_EXTREN_Pos           (22)                                              /*!< EADC_T::SCTL13: EXTREN Position        */
#define EADC_SCTL13_EXTREN_Msk           (0x1ul << EADC_SCTL13_EXTREN_Pos)                 /*!< EADC_T::SCTL13: EXTREN Mask            */

#define EADC_SCTL13_EXTFEN_Pos           (23)                                              /*!< EADC_T::SCTL13: EXTFEN Position        */
#define EADC_SCTL13_EXTFEN_Msk           (0x1ul << EADC_SCTL13_EXTFEN_Pos)                 /*!< EADC_T::SCTL13: EXTFEN Mask            */

#define EADC_SCTL13_EXTSMPT_Pos          (24)                                              /*!< EADC_T::SCTL13: EXTSMPT Position       */
#define EADC_SCTL13_EXTSMPT_Msk          (0xfful << EADC_SCTL13_EXTSMPT_Pos)               /*!< EADC_T::SCTL13: EXTSMPT Mask           */

#define EADC_SCTL14_CHSEL_Pos            (0)                                               /*!< EADC_T::SCTL14: CHSEL Position         */
#define EADC_SCTL14_CHSEL_Msk            (0x1ful << EADC_SCTL14_CHSEL_Pos)                 /*!< EADC_T::SCTL14: CHSEL Mask             */

#define EADC_SCTL14_INTPOS_Pos           (5)                                               /*!< EADC_T::SCTL14: INTPOS Position        */
#define EADC_SCTL14_INTPOS_Msk           (0x1ul << EADC_SCTL14_INTPOS_Pos)                 /*!< EADC_T::SCTL14: INTPOS Mask            */

#define EADC_SCTL14_TRGDLDIV_Pos         (6)                                               /*!< EADC_T::SCTL14: TRGDLDIV Position      */
#define EADC_SCTL14_TRGDLDIV_Msk         (0x3ul << EADC_SCTL14_TRGDLDIV_Pos)               /*!< EADC_T::SCTL14: TRGDLDIV Mask          */

#define EADC_SCTL14_TRGDLCNT_Pos         (8)                                               /*!< EADC_T::SCTL14: TRGDLCNT Position      */
#define EADC_SCTL14_TRGDLCNT_Msk         (0xfful << EADC_SCTL14_TRGDLCNT_Pos)              /*!< EADC_T::SCTL14: TRGDLCNT Mask          */

#define EADC_SCTL14_TRGSEL_Pos           (16)                                              /*!< EADC_T::SCTL14: TRGSEL Position        */
#define EADC_SCTL14_TRGSEL_Msk           (0x3ful << EADC_SCTL14_TRGSEL_Pos)                /*!< EADC_T::SCTL14: TRGSEL Mask            */

#define EADC_SCTL14_EXTREN_Pos           (22)                                              /*!< EADC_T::SCTL14: EXTREN Position        */
#define EADC_SCTL14_EXTREN_Msk           (0x1ul << EADC_SCTL14_EXTREN_Pos)                 /*!< EADC_T::SCTL14: EXTREN Mask            */

#define EADC_SCTL14_EXTFEN_Pos           (23)                                              /*!< EADC_T::SCTL14: EXTFEN Position        */
#define EADC_SCTL14_EXTFEN_Msk           (0x1ul << EADC_SCTL14_EXTFEN_Pos)                 /*!< EADC_T::SCTL14: EXTFEN Mask            */

#define EADC_SCTL14_EXTSMPT_Pos          (24)                                              /*!< EADC_T::SCTL14: EXTSMPT Position       */
#define EADC_SCTL14_EXTSMPT_Msk          (0xfful << EADC_SCTL14_EXTSMPT_Pos)               /*!< EADC_T::SCTL14: EXTSMPT Mask           */

#define EADC_SCTL15_CHSEL_Pos            (0)                                               /*!< EADC_T::SCTL15: CHSEL Position         */
#define EADC_SCTL15_CHSEL_Msk            (0x1ful << EADC_SCTL15_CHSEL_Pos)                 /*!< EADC_T::SCTL15: CHSEL Mask             */

#define EADC_SCTL15_INTPOS_Pos           (5)                                               /*!< EADC_T::SCTL15: INTPOS Position        */
#define EADC_SCTL15_INTPOS_Msk           (0x1ul << EADC_SCTL15_INTPOS_Pos)                 /*!< EADC_T::SCTL15: INTPOS Mask            */

#define EADC_SCTL15_TRGDLDIV_Pos         (6)                                               /*!< EADC_T::SCTL15: TRGDLDIV Position      */
#define EADC_SCTL15_TRGDLDIV_Msk         (0x3ul << EADC_SCTL15_TRGDLDIV_Pos)               /*!< EADC_T::SCTL15: TRGDLDIV Mask          */

#define EADC_SCTL15_TRGDLCNT_Pos         (8)                                               /*!< EADC_T::SCTL15: TRGDLCNT Position      */
#define EADC_SCTL15_TRGDLCNT_Msk         (0xfful << EADC_SCTL15_TRGDLCNT_Pos)              /*!< EADC_T::SCTL15: TRGDLCNT Mask          */

#define EADC_SCTL15_TRGSEL_Pos           (16)                                              /*!< EADC_T::SCTL15: TRGSEL Position        */
#define EADC_SCTL15_TRGSEL_Msk           (0x3ful << EADC_SCTL15_TRGSEL_Pos)                /*!< EADC_T::SCTL15: TRGSEL Mask            */

#define EADC_SCTL15_EXTREN_Pos           (22)                                              /*!< EADC_T::SCTL15: EXTREN Position        */
#define EADC_SCTL15_EXTREN_Msk           (0x1ul << EADC_SCTL15_EXTREN_Pos)                 /*!< EADC_T::SCTL15: EXTREN Mask            */

#define EADC_SCTL15_EXTFEN_Pos           (23)                                              /*!< EADC_T::SCTL15: EXTFEN Position        */
#define EADC_SCTL15_EXTFEN_Msk           (0x1ul << EADC_SCTL15_EXTFEN_Pos)                 /*!< EADC_T::SCTL15: EXTFEN Mask            */

#define EADC_SCTL15_EXTSMPT_Pos          (24)                                              /*!< EADC_T::SCTL15: EXTSMPT Position       */
#define EADC_SCTL15_EXTSMPT_Msk          (0xfful << EADC_SCTL15_EXTSMPT_Pos)               /*!< EADC_T::SCTL15: EXTSMPT Mask           */

#define EADC_SCTL16_CHSEL_Pos            (0)                                               /*!< EADC_T::SCTL16: CHSEL Position         */
#define EADC_SCTL16_CHSEL_Msk            (0x1ful << EADC_SCTL16_CHSEL_Pos)                 /*!< EADC_T::SCTL16: CHSEL Mask             */

