zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/eadc_reg.h
#define EADC_SCTL16_INTPOS_Pos           (5)                                               /*!< EADC_T::SCTL16: INTPOS Position        */
#define EADC_SCTL16_INTPOS_Msk           (0x1ul << EADC_SCTL16_INTPOS_Pos)                 /*!< EADC_T::SCTL16: INTPOS Mask            */

#define EADC_SCTL16_TRGDLDIV_Pos         (6)                                               /*!< EADC_T::SCTL16: TRGDLDIV Position      */
#define EADC_SCTL16_TRGDLDIV_Msk         (0x3ul << EADC_SCTL16_TRGDLDIV_Pos)               /*!< EADC_T::SCTL16: TRGDLDIV Mask          */

#define EADC_SCTL16_TRGDLCNT_Pos         (8)                                               /*!< EADC_T::SCTL16: TRGDLCNT Position      */
#define EADC_SCTL16_TRGDLCNT_Msk         (0xfful << EADC_SCTL16_TRGDLCNT_Pos)              /*!< EADC_T::SCTL16: TRGDLCNT Mask          */

#define EADC_SCTL16_TRGSEL_Pos           (16)                                              /*!< EADC_T::SCTL16: TRGSEL Position        */
#define EADC_SCTL16_TRGSEL_Msk           (0x3ful << EADC_SCTL16_TRGSEL_Pos)                /*!< EADC_T::SCTL16: TRGSEL Mask            */

#define EADC_SCTL16_EXTREN_Pos           (22)                                              /*!< EADC_T::SCTL16: EXTREN Position        */
#define EADC_SCTL16_EXTREN_Msk           (0x1ul << EADC_SCTL16_EXTREN_Pos)                 /*!< EADC_T::SCTL16: EXTREN Mask            */

#define EADC_SCTL16_EXTFEN_Pos           (23)                                              /*!< EADC_T::SCTL16: EXTFEN Position        */
#define EADC_SCTL16_EXTFEN_Msk           (0x1ul << EADC_SCTL16_EXTFEN_Pos)                 /*!< EADC_T::SCTL16: EXTFEN Mask            */

#define EADC_SCTL16_EXTSMPT_Pos          (24)                                              /*!< EADC_T::SCTL16: EXTSMPT Position       */
#define EADC_SCTL16_EXTSMPT_Msk          (0xfful << EADC_SCTL16_EXTSMPT_Pos)               /*!< EADC_T::SCTL16: EXTSMPT Mask           */

#define EADC_SCTL17_CHSEL_Pos            (0)                                               /*!< EADC_T::SCTL17: CHSEL Position         */
#define EADC_SCTL17_CHSEL_Msk            (0x1ful << EADC_SCTL17_CHSEL_Pos)                 /*!< EADC_T::SCTL17: CHSEL Mask             */

#define EADC_SCTL17_INTPOS_Pos           (5)                                               /*!< EADC_T::SCTL17: INTPOS Position        */
#define EADC_SCTL17_INTPOS_Msk           (0x1ul << EADC_SCTL17_INTPOS_Pos)                 /*!< EADC_T::SCTL17: INTPOS Mask            */

#define EADC_SCTL17_TRGDLDIV_Pos         (6)                                               /*!< EADC_T::SCTL17: TRGDLDIV Position      */
#define EADC_SCTL17_TRGDLDIV_Msk         (0x3ul << EADC_SCTL17_TRGDLDIV_Pos)               /*!< EADC_T::SCTL17: TRGDLDIV Mask          */

#define EADC_SCTL17_TRGDLCNT_Pos         (8)                                               /*!< EADC_T::SCTL17: TRGDLCNT Position      */
#define EADC_SCTL17_TRGDLCNT_Msk         (0xfful << EADC_SCTL17_TRGDLCNT_Pos)              /*!< EADC_T::SCTL17: TRGDLCNT Mask          */

#define EADC_SCTL17_TRGSEL_Pos           (16)                                              /*!< EADC_T::SCTL17: TRGSEL Position        */
#define EADC_SCTL17_TRGSEL_Msk           (0x3ful << EADC_SCTL17_TRGSEL_Pos)                /*!< EADC_T::SCTL17: TRGSEL Mask            */

#define EADC_SCTL17_EXTREN_Pos           (22)                                              /*!< EADC_T::SCTL17: EXTREN Position        */
#define EADC_SCTL17_EXTREN_Msk           (0x1ul << EADC_SCTL17_EXTREN_Pos)                 /*!< EADC_T::SCTL17: EXTREN Mask            */

#define EADC_SCTL17_EXTFEN_Pos           (23)                                              /*!< EADC_T::SCTL17: EXTFEN Position        */
#define EADC_SCTL17_EXTFEN_Msk           (0x1ul << EADC_SCTL17_EXTFEN_Pos)                 /*!< EADC_T::SCTL17: EXTFEN Mask            */

#define EADC_SCTL17_EXTSMPT_Pos          (24)                                              /*!< EADC_T::SCTL17: EXTSMPT Position       */
#define EADC_SCTL17_EXTSMPT_Msk          (0xfful << EADC_SCTL17_EXTSMPT_Pos)               /*!< EADC_T::SCTL17: EXTSMPT Mask           */

#define EADC_SCTL18_CHSEL_Pos            (0)                                               /*!< EADC_T::SCTL18: CHSEL Position         */
#define EADC_SCTL18_CHSEL_Msk            (0x1ful << EADC_SCTL18_CHSEL_Pos)                 /*!< EADC_T::SCTL18: CHSEL Mask             */

#define EADC_SCTL18_INTPOS_Pos           (5)                                               /*!< EADC_T::SCTL18: INTPOS Position        */
#define EADC_SCTL18_INTPOS_Msk           (0x1ul << EADC_SCTL18_INTPOS_Pos)                 /*!< EADC_T::SCTL18: INTPOS Mask            */

#define EADC_SCTL18_TRGDLDIV_Pos         (6)                                               /*!< EADC_T::SCTL18: TRGDLDIV Position      */
#define EADC_SCTL18_TRGDLDIV_Msk         (0x3ul << EADC_SCTL18_TRGDLDIV_Pos)               /*!< EADC_T::SCTL18: TRGDLDIV Mask          */

#define EADC_SCTL18_TRGDLCNT_Pos         (8)                                               /*!< EADC_T::SCTL18: TRGDLCNT Position      */
#define EADC_SCTL18_TRGDLCNT_Msk         (0xfful << EADC_SCTL18_TRGDLCNT_Pos)              /*!< EADC_T::SCTL18: TRGDLCNT Mask          */

#define EADC_SCTL18_TRGSEL_Pos           (16)                                              /*!< EADC_T::SCTL18: TRGSEL Position        */
#define EADC_SCTL18_TRGSEL_Msk           (0x3ful << EADC_SCTL18_TRGSEL_Pos)                /*!< EADC_T::SCTL18: TRGSEL Mask            */

#define EADC_SCTL18_EXTREN_Pos           (22)                                              /*!< EADC_T::SCTL18: EXTREN Position        */
#define EADC_SCTL18_EXTREN_Msk           (0x1ul << EADC_SCTL18_EXTREN_Pos)                 /*!< EADC_T::SCTL18: EXTREN Mask            */

#define EADC_SCTL18_EXTFEN_Pos           (23)                                              /*!< EADC_T::SCTL18: EXTFEN Position        */
#define EADC_SCTL18_EXTFEN_Msk           (0x1ul << EADC_SCTL18_EXTFEN_Pos)                 /*!< EADC_T::SCTL18: EXTFEN Mask            */

#define EADC_SCTL18_EXTSMPT_Pos          (24)                                              /*!< EADC_T::SCTL18: EXTSMPT Position       */
#define EADC_SCTL18_EXTSMPT_Msk          (0xfful << EADC_SCTL18_EXTSMPT_Pos)               /*!< EADC_T::SCTL18: EXTSMPT Mask           */

#define EADC_INTSRC_SPLIE0_Pos           (0)                                               /*!< EADC_T::INTSRC: SPLIE0 Position        */
#define EADC_INTSRC_SPLIE0_Msk           (0x1ul << EADC_INTSRC_SPLIE0_Pos)                 /*!< EADC_T::INTSRC: SPLIE0 Mask            */

#define EADC_INTSRC_SPLIE1_Pos           (1)                                               /*!< EADC_T::INTSRC: SPLIE1 Position        */
#define EADC_INTSRC_SPLIE1_Msk           (0x1ul << EADC_INTSRC_SPLIE1_Pos)                 /*!< EADC_T::INTSRC: SPLIE1 Mask            */

