zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/eadc_reg.h
#define EADC_INTSRC_SPLIE2_Pos           (2)                                               /*!< EADC_T::INTSRC: SPLIE2 Position        */
#define EADC_INTSRC_SPLIE2_Msk           (0x1ul << EADC_INTSRC_SPLIE2_Pos)                 /*!< EADC_T::INTSRC: SPLIE2 Mask            */

#define EADC_INTSRC_SPLIE3_Pos           (3)                                               /*!< EADC_T::INTSRC: SPLIE3 Position        */
#define EADC_INTSRC_SPLIE3_Msk           (0x1ul << EADC_INTSRC_SPLIE3_Pos)                 /*!< EADC_T::INTSRC: SPLIE3 Mask            */

#define EADC_INTSRC_SPLIE4_Pos           (4)                                               /*!< EADC_T::INTSRC: SPLIE4 Position        */
#define EADC_INTSRC_SPLIE4_Msk           (0x1ul << EADC_INTSRC_SPLIE4_Pos)                 /*!< EADC_T::INTSRC: SPLIE4 Mask            */

#define EADC_INTSRC_SPLIE5_Pos           (5)                                               /*!< EADC_T::INTSRC: SPLIE5 Position        */
#define EADC_INTSRC_SPLIE5_Msk           (0x1ul << EADC_INTSRC_SPLIE5_Pos)                 /*!< EADC_T::INTSRC: SPLIE5 Mask            */

#define EADC_INTSRC_SPLIE6_Pos           (6)                                               /*!< EADC_T::INTSRC: SPLIE6 Position        */
#define EADC_INTSRC_SPLIE6_Msk           (0x1ul << EADC_INTSRC_SPLIE6_Pos)                 /*!< EADC_T::INTSRC: SPLIE6 Mask            */

#define EADC_INTSRC_SPLIE7_Pos           (7)                                               /*!< EADC_T::INTSRC: SPLIE7 Position        */
#define EADC_INTSRC_SPLIE7_Msk           (0x1ul << EADC_INTSRC_SPLIE7_Pos)                 /*!< EADC_T::INTSRC: SPLIE7 Mask            */

#define EADC_INTSRC_SPLIE8_Pos           (8)                                               /*!< EADC_T::INTSRC: SPLIE8 Position        */
#define EADC_INTSRC_SPLIE8_Msk           (0x1ul << EADC_INTSRC_SPLIE8_Pos)                 /*!< EADC_T::INTSRC: SPLIE8 Mask            */

#define EADC_INTSRC_SPLIE9_Pos           (9)                                               /*!< EADC_T::INTSRC: SPLIE9 Position        */
#define EADC_INTSRC_SPLIE9_Msk           (0x1ul << EADC_INTSRC_SPLIE9_Pos)                 /*!< EADC_T::INTSRC: SPLIE9 Mask            */

#define EADC_INTSRC_SPLIE10_Pos          (10)                                              /*!< EADC_T::INTSRC: SPLIE10 Position       */
#define EADC_INTSRC_SPLIE10_Msk          (0x1ul << EADC_INTSRC_SPLIE10_Pos)                /*!< EADC_T::INTSRC: SPLIE10 Mask           */

#define EADC_INTSRC_SPLIE11_Pos          (11)                                              /*!< EADC_T::INTSRC: SPLIE11 Position       */
#define EADC_INTSRC_SPLIE11_Msk          (0x1ul << EADC_INTSRC_SPLIE11_Pos)                /*!< EADC_T::INTSRC: SPLIE11 Mask           */

#define EADC_INTSRC_SPLIE12_Pos          (12)                                              /*!< EADC_T::INTSRC: SPLIE12 Position       */
#define EADC_INTSRC_SPLIE12_Msk          (0x1ul << EADC_INTSRC_SPLIE12_Pos)                /*!< EADC_T::INTSRC: SPLIE12 Mask           */

#define EADC_INTSRC_SPLIE13_Pos          (13)                                              /*!< EADC_T::INTSRC: SPLIE13 Position       */
#define EADC_INTSRC_SPLIE13_Msk          (0x1ul << EADC_INTSRC_SPLIE13_Pos)                /*!< EADC_T::INTSRC: SPLIE13 Mask           */

#define EADC_INTSRC_SPLIE14_Pos          (14)                                              /*!< EADC_T::INTSRC: SPLIE14 Position       */
#define EADC_INTSRC_SPLIE14_Msk          (0x1ul << EADC_INTSRC_SPLIE14_Pos)                /*!< EADC_T::INTSRC: SPLIE14 Mask           */

#define EADC_INTSRC_SPLIE15_Pos          (15)                                              /*!< EADC_T::INTSRC: SPLIE15 Position       */
#define EADC_INTSRC_SPLIE15_Msk          (0x1ul << EADC_INTSRC_SPLIE15_Pos)                /*!< EADC_T::INTSRC: SPLIE15 Mask           */

#define EADC_INTSRC_SPLIE16_Pos          (16)                                              /*!< EADC_T::INTSRC: SPLIE16 Position       */
#define EADC_INTSRC_SPLIE16_Msk          (0x1ul << EADC_INTSRC_SPLIE16_Pos)                /*!< EADC_T::INTSRC: SPLIE16 Mask           */

#define EADC_INTSRC_SPLIE17_Pos          (17)                                              /*!< EADC_T::INTSRC: SPLIE17 Position       */
#define EADC_INTSRC_SPLIE17_Msk          (0x1ul << EADC_INTSRC_SPLIE17_Pos)                /*!< EADC_T::INTSRC: SPLIE17 Mask           */

#define EADC_INTSRC_SPLIE18_Pos          (18)                                              /*!< EADC_T::INTSRC: SPLIE18 Position       */
#define EADC_INTSRC_SPLIE18_Msk          (0x1ul << EADC_INTSRC_SPLIE18_Pos)                /*!< EADC_T::INTSRC: SPLIE18 Mask           */

#define EADC_INTSRC_SPLIE19_Pos          (19)                                              /*!< EADC_T::INTSRC: SPLIE19 Position       */
#define EADC_INTSRC_SPLIE19_Msk          (0x1ul << EADC_INTSRC_SPLIE19_Pos)                /*!< EADC_T::INTSRC: SPLIE19 Mask           */

#define EADC_INTSRC_SPLIE20_Pos          (20)                                              /*!< EADC_T::INTSRC: SPLIE20 Position       */
#define EADC_INTSRC_SPLIE20_Msk          (0x1ul << EADC_INTSRC_SPLIE20_Pos)                /*!< EADC_T::INTSRC: SPLIE20 Mask           */

#define EADC_INTSRC_SPLIE21_Pos          (21)                                              /*!< EADC_T::INTSRC: SPLIE21 Position       */
#define EADC_INTSRC_SPLIE21_Msk          (0x1ul << EADC_INTSRC_SPLIE21_Pos)                /*!< EADC_T::INTSRC: SPLIE21 Mask           */

#define EADC_INTSRC_SPLIE22_Pos          (22)                                              /*!< EADC_T::INTSRC: SPLIE22 Position       */
#define EADC_INTSRC_SPLIE22_Msk          (0x1ul << EADC_INTSRC_SPLIE22_Pos)                /*!< EADC_T::INTSRC: SPLIE22 Mask           */

#define EADC_INTSRC_SPLIE23_Pos          (23)                                              /*!< EADC_T::INTSRC: SPLIE23 Position       */
#define EADC_INTSRC_SPLIE23_Msk          (0x1ul << EADC_INTSRC_SPLIE23_Pos)                /*!< EADC_T::INTSRC: SPLIE23 Mask           */

#define EADC_INTSRC_SPLIE24_Pos          (24)                                              /*!< EADC_T::INTSRC: SPLIE24 Position       */
#define EADC_INTSRC_SPLIE24_Msk          (0x1ul << EADC_INTSRC_SPLIE24_Pos)                /*!< EADC_T::INTSRC: SPLIE24 Mask           */

#define EADC_INTSRC_SPLIE25_Pos          (25)                                              /*!< EADC_T::INTSRC: SPLIE25 Position       */
#define EADC_INTSRC_SPLIE25_Msk          (0x1ul << EADC_INTSRC_SPLIE25_Pos)                /*!< EADC_T::INTSRC: SPLIE25 Mask           */

#define EADC_INTSRC_SPLIE26_Pos          (26)                                              /*!< EADC_T::INTSRC: SPLIE26 Position       */
#define EADC_INTSRC_SPLIE26_Msk          (0x1ul << EADC_INTSRC_SPLIE26_Pos)                /*!< EADC_T::INTSRC: SPLIE26 Mask           */

#define EADC_INTSRC_SPLIE27_Pos          (27)                                              /*!< EADC_T::INTSRC: SPLIE27 Position       */
#define EADC_INTSRC_SPLIE27_Msk          (0x1ul << EADC_INTSRC_SPLIE27_Pos)                /*!< EADC_T::INTSRC: SPLIE27 Mask           */

#define EADC_INTSRC0_SPLIE0_Pos          (0)                                               /*!< EADC_T::INTSRC0: SPLIE0 Position       */
#define EADC_INTSRC0_SPLIE0_Msk          (0x1ul << EADC_INTSRC0_SPLIE0_Pos)                /*!< EADC_T::INTSRC0: SPLIE0 Mask           */

