zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/eadc_reg.h
#define EADC_INTSRC1_SPLIE20_Pos         (20)                                              /*!< EADC_T::INTSRC1: SPLIE20 Position      */
#define EADC_INTSRC1_SPLIE20_Msk         (0x1ul << EADC_INTSRC1_SPLIE20_Pos)               /*!< EADC_T::INTSRC1: SPLIE20 Mask          */

#define EADC_INTSRC1_SPLIE21_Pos         (21)                                              /*!< EADC_T::INTSRC1: SPLIE21 Position      */
#define EADC_INTSRC1_SPLIE21_Msk         (0x1ul << EADC_INTSRC1_SPLIE21_Pos)               /*!< EADC_T::INTSRC1: SPLIE21 Mask          */

#define EADC_INTSRC1_SPLIE22_Pos         (22)                                              /*!< EADC_T::INTSRC1: SPLIE22 Position      */
#define EADC_INTSRC1_SPLIE22_Msk         (0x1ul << EADC_INTSRC1_SPLIE22_Pos)               /*!< EADC_T::INTSRC1: SPLIE22 Mask          */

#define EADC_INTSRC1_SPLIE23_Pos         (23)                                              /*!< EADC_T::INTSRC1: SPLIE23 Position      */
#define EADC_INTSRC1_SPLIE23_Msk         (0x1ul << EADC_INTSRC1_SPLIE23_Pos)               /*!< EADC_T::INTSRC1: SPLIE23 Mask          */

#define EADC_INTSRC1_SPLIE24_Pos         (24)                                              /*!< EADC_T::INTSRC1: SPLIE24 Position      */
#define EADC_INTSRC1_SPLIE24_Msk         (0x1ul << EADC_INTSRC1_SPLIE24_Pos)               /*!< EADC_T::INTSRC1: SPLIE24 Mask          */

#define EADC_INTSRC1_SPLIE25_Pos         (25)                                              /*!< EADC_T::INTSRC1: SPLIE25 Position      */
#define EADC_INTSRC1_SPLIE25_Msk         (0x1ul << EADC_INTSRC1_SPLIE25_Pos)               /*!< EADC_T::INTSRC1: SPLIE25 Mask          */

#define EADC_INTSRC1_SPLIE26_Pos         (26)                                              /*!< EADC_T::INTSRC1: SPLIE26 Position      */
#define EADC_INTSRC1_SPLIE26_Msk         (0x1ul << EADC_INTSRC1_SPLIE26_Pos)               /*!< EADC_T::INTSRC1: SPLIE26 Mask          */

#define EADC_INTSRC1_SPLIE27_Pos         (27)                                              /*!< EADC_T::INTSRC1: SPLIE27 Position      */
#define EADC_INTSRC1_SPLIE27_Msk         (0x1ul << EADC_INTSRC1_SPLIE27_Pos)               /*!< EADC_T::INTSRC1: SPLIE27 Mask          */

#define EADC_INTSRC2_SPLIE0_Pos          (0)                                               /*!< EADC_T::INTSRC2: SPLIE0 Position       */
#define EADC_INTSRC2_SPLIE0_Msk          (0x1ul << EADC_INTSRC2_SPLIE0_Pos)                /*!< EADC_T::INTSRC2: SPLIE0 Mask           */

#define EADC_INTSRC2_SPLIE1_Pos          (1)                                               /*!< EADC_T::INTSRC2: SPLIE1 Position       */
#define EADC_INTSRC2_SPLIE1_Msk          (0x1ul << EADC_INTSRC2_SPLIE1_Pos)                /*!< EADC_T::INTSRC2: SPLIE1 Mask           */

#define EADC_INTSRC2_SPLIE2_Pos          (2)                                               /*!< EADC_T::INTSRC2: SPLIE2 Position       */
#define EADC_INTSRC2_SPLIE2_Msk          (0x1ul << EADC_INTSRC2_SPLIE2_Pos)                /*!< EADC_T::INTSRC2: SPLIE2 Mask           */

#define EADC_INTSRC2_SPLIE3_Pos          (3)                                               /*!< EADC_T::INTSRC2: SPLIE3 Position       */
#define EADC_INTSRC2_SPLIE3_Msk          (0x1ul << EADC_INTSRC2_SPLIE3_Pos)                /*!< EADC_T::INTSRC2: SPLIE3 Mask           */

#define EADC_INTSRC2_SPLIE4_Pos          (4)                                               /*!< EADC_T::INTSRC2: SPLIE4 Position       */
#define EADC_INTSRC2_SPLIE4_Msk          (0x1ul << EADC_INTSRC2_SPLIE4_Pos)                /*!< EADC_T::INTSRC2: SPLIE4 Mask           */

#define EADC_INTSRC2_SPLIE5_Pos          (5)                                               /*!< EADC_T::INTSRC2: SPLIE5 Position       */
#define EADC_INTSRC2_SPLIE5_Msk          (0x1ul << EADC_INTSRC2_SPLIE5_Pos)                /*!< EADC_T::INTSRC2: SPLIE5 Mask           */

#define EADC_INTSRC2_SPLIE6_Pos          (6)                                               /*!< EADC_T::INTSRC2: SPLIE6 Position       */
#define EADC_INTSRC2_SPLIE6_Msk          (0x1ul << EADC_INTSRC2_SPLIE6_Pos)                /*!< EADC_T::INTSRC2: SPLIE6 Mask           */

#define EADC_INTSRC2_SPLIE7_Pos          (7)                                               /*!< EADC_T::INTSRC2: SPLIE7 Position       */
#define EADC_INTSRC2_SPLIE7_Msk          (0x1ul << EADC_INTSRC2_SPLIE7_Pos)                /*!< EADC_T::INTSRC2: SPLIE7 Mask           */

#define EADC_INTSRC2_SPLIE8_Pos          (8)                                               /*!< EADC_T::INTSRC2: SPLIE8 Position       */
#define EADC_INTSRC2_SPLIE8_Msk          (0x1ul << EADC_INTSRC2_SPLIE8_Pos)                /*!< EADC_T::INTSRC2: SPLIE8 Mask           */

#define EADC_INTSRC2_SPLIE9_Pos          (9)                                               /*!< EADC_T::INTSRC2: SPLIE9 Position       */
#define EADC_INTSRC2_SPLIE9_Msk          (0x1ul << EADC_INTSRC2_SPLIE9_Pos)                /*!< EADC_T::INTSRC2: SPLIE9 Mask           */

#define EADC_INTSRC2_SPLIE10_Pos         (10)                                              /*!< EADC_T::INTSRC2: SPLIE10 Position      */
#define EADC_INTSRC2_SPLIE10_Msk         (0x1ul << EADC_INTSRC2_SPLIE10_Pos)               /*!< EADC_T::INTSRC2: SPLIE10 Mask          */

#define EADC_INTSRC2_SPLIE11_Pos         (11)                                              /*!< EADC_T::INTSRC2: SPLIE11 Position      */
#define EADC_INTSRC2_SPLIE11_Msk         (0x1ul << EADC_INTSRC2_SPLIE11_Pos)               /*!< EADC_T::INTSRC2: SPLIE11 Mask          */

#define EADC_INTSRC2_SPLIE12_Pos         (12)                                              /*!< EADC_T::INTSRC2: SPLIE12 Position      */
#define EADC_INTSRC2_SPLIE12_Msk         (0x1ul << EADC_INTSRC2_SPLIE12_Pos)               /*!< EADC_T::INTSRC2: SPLIE12 Mask          */

#define EADC_INTSRC2_SPLIE13_Pos         (13)                                              /*!< EADC_T::INTSRC2: SPLIE13 Position      */
#define EADC_INTSRC2_SPLIE13_Msk         (0x1ul << EADC_INTSRC2_SPLIE13_Pos)               /*!< EADC_T::INTSRC2: SPLIE13 Mask          */

#define EADC_INTSRC2_SPLIE14_Pos         (14)                                              /*!< EADC_T::INTSRC2: SPLIE14 Position      */
#define EADC_INTSRC2_SPLIE14_Msk         (0x1ul << EADC_INTSRC2_SPLIE14_Pos)               /*!< EADC_T::INTSRC2: SPLIE14 Mask          */

#define EADC_INTSRC2_SPLIE15_Pos         (15)                                              /*!< EADC_T::INTSRC2: SPLIE15 Position      */
#define EADC_INTSRC2_SPLIE15_Msk         (0x1ul << EADC_INTSRC2_SPLIE15_Pos)               /*!< EADC_T::INTSRC2: SPLIE15 Mask          */

