zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/eadc_reg.h
#define EADC_INTSRC2_SPLIE16_Pos         (16)                                              /*!< EADC_T::INTSRC2: SPLIE16 Position      */
#define EADC_INTSRC2_SPLIE16_Msk         (0x1ul << EADC_INTSRC2_SPLIE16_Pos)               /*!< EADC_T::INTSRC2: SPLIE16 Mask          */

#define EADC_INTSRC2_SPLIE17_Pos         (17)                                              /*!< EADC_T::INTSRC2: SPLIE17 Position      */
#define EADC_INTSRC2_SPLIE17_Msk         (0x1ul << EADC_INTSRC2_SPLIE17_Pos)               /*!< EADC_T::INTSRC2: SPLIE17 Mask          */

#define EADC_INTSRC2_SPLIE18_Pos         (18)                                              /*!< EADC_T::INTSRC2: SPLIE18 Position      */
#define EADC_INTSRC2_SPLIE18_Msk         (0x1ul << EADC_INTSRC2_SPLIE18_Pos)               /*!< EADC_T::INTSRC2: SPLIE18 Mask          */

#define EADC_INTSRC2_SPLIE19_Pos         (19)                                              /*!< EADC_T::INTSRC2: SPLIE19 Position      */
#define EADC_INTSRC2_SPLIE19_Msk         (0x1ul << EADC_INTSRC2_SPLIE19_Pos)               /*!< EADC_T::INTSRC2: SPLIE19 Mask          */

#define EADC_INTSRC2_SPLIE20_Pos         (20)                                              /*!< EADC_T::INTSRC2: SPLIE20 Position      */
#define EADC_INTSRC2_SPLIE20_Msk         (0x1ul << EADC_INTSRC2_SPLIE20_Pos)               /*!< EADC_T::INTSRC2: SPLIE20 Mask          */

#define EADC_INTSRC2_SPLIE21_Pos         (21)                                              /*!< EADC_T::INTSRC2: SPLIE21 Position      */
#define EADC_INTSRC2_SPLIE21_Msk         (0x1ul << EADC_INTSRC2_SPLIE21_Pos)               /*!< EADC_T::INTSRC2: SPLIE21 Mask          */

#define EADC_INTSRC2_SPLIE22_Pos         (22)                                              /*!< EADC_T::INTSRC2: SPLIE22 Position      */
#define EADC_INTSRC2_SPLIE22_Msk         (0x1ul << EADC_INTSRC2_SPLIE22_Pos)               /*!< EADC_T::INTSRC2: SPLIE22 Mask          */

#define EADC_INTSRC2_SPLIE23_Pos         (23)                                              /*!< EADC_T::INTSRC2: SPLIE23 Position      */
#define EADC_INTSRC2_SPLIE23_Msk         (0x1ul << EADC_INTSRC2_SPLIE23_Pos)               /*!< EADC_T::INTSRC2: SPLIE23 Mask          */

#define EADC_INTSRC2_SPLIE24_Pos         (24)                                              /*!< EADC_T::INTSRC2: SPLIE24 Position      */
#define EADC_INTSRC2_SPLIE24_Msk         (0x1ul << EADC_INTSRC2_SPLIE24_Pos)               /*!< EADC_T::INTSRC2: SPLIE24 Mask          */

#define EADC_INTSRC2_SPLIE25_Pos         (25)                                              /*!< EADC_T::INTSRC2: SPLIE25 Position      */
#define EADC_INTSRC2_SPLIE25_Msk         (0x1ul << EADC_INTSRC2_SPLIE25_Pos)               /*!< EADC_T::INTSRC2: SPLIE25 Mask          */

#define EADC_INTSRC2_SPLIE26_Pos         (26)                                              /*!< EADC_T::INTSRC2: SPLIE26 Position      */
#define EADC_INTSRC2_SPLIE26_Msk         (0x1ul << EADC_INTSRC2_SPLIE26_Pos)               /*!< EADC_T::INTSRC2: SPLIE26 Mask          */

#define EADC_INTSRC2_SPLIE27_Pos         (27)                                              /*!< EADC_T::INTSRC2: SPLIE27 Position      */
#define EADC_INTSRC2_SPLIE27_Msk         (0x1ul << EADC_INTSRC2_SPLIE27_Pos)               /*!< EADC_T::INTSRC2: SPLIE27 Mask          */

#define EADC_INTSRC3_SPLIE0_Pos          (0)                                               /*!< EADC_T::INTSRC3: SPLIE0 Position       */
#define EADC_INTSRC3_SPLIE0_Msk          (0x1ul << EADC_INTSRC3_SPLIE0_Pos)                /*!< EADC_T::INTSRC3: SPLIE0 Mask           */

#define EADC_INTSRC3_SPLIE1_Pos          (1)                                               /*!< EADC_T::INTSRC3: SPLIE1 Position       */
#define EADC_INTSRC3_SPLIE1_Msk          (0x1ul << EADC_INTSRC3_SPLIE1_Pos)                /*!< EADC_T::INTSRC3: SPLIE1 Mask           */

#define EADC_INTSRC3_SPLIE2_Pos          (2)                                               /*!< EADC_T::INTSRC3: SPLIE2 Position       */
#define EADC_INTSRC3_SPLIE2_Msk          (0x1ul << EADC_INTSRC3_SPLIE2_Pos)                /*!< EADC_T::INTSRC3: SPLIE2 Mask           */

#define EADC_INTSRC3_SPLIE3_Pos          (3)                                               /*!< EADC_T::INTSRC3: SPLIE3 Position       */
#define EADC_INTSRC3_SPLIE3_Msk          (0x1ul << EADC_INTSRC3_SPLIE3_Pos)                /*!< EADC_T::INTSRC3: SPLIE3 Mask           */

#define EADC_INTSRC3_SPLIE4_Pos          (4)                                               /*!< EADC_T::INTSRC3: SPLIE4 Position       */
#define EADC_INTSRC3_SPLIE4_Msk          (0x1ul << EADC_INTSRC3_SPLIE4_Pos)                /*!< EADC_T::INTSRC3: SPLIE4 Mask           */

#define EADC_INTSRC3_SPLIE5_Pos          (5)                                               /*!< EADC_T::INTSRC3: SPLIE5 Position       */
#define EADC_INTSRC3_SPLIE5_Msk          (0x1ul << EADC_INTSRC3_SPLIE5_Pos)                /*!< EADC_T::INTSRC3: SPLIE5 Mask           */

#define EADC_INTSRC3_SPLIE6_Pos          (6)                                               /*!< EADC_T::INTSRC3: SPLIE6 Position       */
#define EADC_INTSRC3_SPLIE6_Msk          (0x1ul << EADC_INTSRC3_SPLIE6_Pos)                /*!< EADC_T::INTSRC3: SPLIE6 Mask           */

#define EADC_INTSRC3_SPLIE7_Pos          (7)                                               /*!< EADC_T::INTSRC3: SPLIE7 Position       */
#define EADC_INTSRC3_SPLIE7_Msk          (0x1ul << EADC_INTSRC3_SPLIE7_Pos)                /*!< EADC_T::INTSRC3: SPLIE7 Mask           */

#define EADC_INTSRC3_SPLIE8_Pos          (8)                                               /*!< EADC_T::INTSRC3: SPLIE8 Position       */
#define EADC_INTSRC3_SPLIE8_Msk          (0x1ul << EADC_INTSRC3_SPLIE8_Pos)                /*!< EADC_T::INTSRC3: SPLIE8 Mask           */

#define EADC_INTSRC3_SPLIE9_Pos          (9)                                               /*!< EADC_T::INTSRC3: SPLIE9 Position       */
#define EADC_INTSRC3_SPLIE9_Msk          (0x1ul << EADC_INTSRC3_SPLIE9_Pos)                /*!< EADC_T::INTSRC3: SPLIE9 Mask           */

#define EADC_INTSRC3_SPLIE10_Pos         (10)                                              /*!< EADC_T::INTSRC3: SPLIE10 Position      */
#define EADC_INTSRC3_SPLIE10_Msk         (0x1ul << EADC_INTSRC3_SPLIE10_Pos)               /*!< EADC_T::INTSRC3: SPLIE10 Mask          */

#define EADC_INTSRC3_SPLIE11_Pos         (11)                                              /*!< EADC_T::INTSRC3: SPLIE11 Position      */
#define EADC_INTSRC3_SPLIE11_Msk         (0x1ul << EADC_INTSRC3_SPLIE11_Pos)               /*!< EADC_T::INTSRC3: SPLIE11 Mask          */

