zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/eadc_reg.h
#define EADC_INTSRC3_SPLIE12_Pos         (12)                                              /*!< EADC_T::INTSRC3: SPLIE12 Position      */
#define EADC_INTSRC3_SPLIE12_Msk         (0x1ul << EADC_INTSRC3_SPLIE12_Pos)               /*!< EADC_T::INTSRC3: SPLIE12 Mask          */

#define EADC_INTSRC3_SPLIE13_Pos         (13)                                              /*!< EADC_T::INTSRC3: SPLIE13 Position      */
#define EADC_INTSRC3_SPLIE13_Msk         (0x1ul << EADC_INTSRC3_SPLIE13_Pos)               /*!< EADC_T::INTSRC3: SPLIE13 Mask          */

#define EADC_INTSRC3_SPLIE14_Pos         (14)                                              /*!< EADC_T::INTSRC3: SPLIE14 Position      */
#define EADC_INTSRC3_SPLIE14_Msk         (0x1ul << EADC_INTSRC3_SPLIE14_Pos)               /*!< EADC_T::INTSRC3: SPLIE14 Mask          */

#define EADC_INTSRC3_SPLIE15_Pos         (15)                                              /*!< EADC_T::INTSRC3: SPLIE15 Position      */
#define EADC_INTSRC3_SPLIE15_Msk         (0x1ul << EADC_INTSRC3_SPLIE15_Pos)               /*!< EADC_T::INTSRC3: SPLIE15 Mask          */

#define EADC_INTSRC3_SPLIE16_Pos         (16)                                              /*!< EADC_T::INTSRC3: SPLIE16 Position      */
#define EADC_INTSRC3_SPLIE16_Msk         (0x1ul << EADC_INTSRC3_SPLIE16_Pos)               /*!< EADC_T::INTSRC3: SPLIE16 Mask          */

#define EADC_INTSRC3_SPLIE17_Pos         (17)                                              /*!< EADC_T::INTSRC3: SPLIE17 Position      */
#define EADC_INTSRC3_SPLIE17_Msk         (0x1ul << EADC_INTSRC3_SPLIE17_Pos)               /*!< EADC_T::INTSRC3: SPLIE17 Mask          */

#define EADC_INTSRC3_SPLIE18_Pos         (18)                                              /*!< EADC_T::INTSRC3: SPLIE18 Position      */
#define EADC_INTSRC3_SPLIE18_Msk         (0x1ul << EADC_INTSRC3_SPLIE18_Pos)               /*!< EADC_T::INTSRC3: SPLIE18 Mask          */

#define EADC_INTSRC3_SPLIE19_Pos         (19)                                              /*!< EADC_T::INTSRC3: SPLIE19 Position      */
#define EADC_INTSRC3_SPLIE19_Msk         (0x1ul << EADC_INTSRC3_SPLIE19_Pos)               /*!< EADC_T::INTSRC3: SPLIE19 Mask          */

#define EADC_INTSRC3_SPLIE20_Pos         (20)                                              /*!< EADC_T::INTSRC3: SPLIE20 Position      */
#define EADC_INTSRC3_SPLIE20_Msk         (0x1ul << EADC_INTSRC3_SPLIE20_Pos)               /*!< EADC_T::INTSRC3: SPLIE20 Mask          */

#define EADC_INTSRC3_SPLIE21_Pos         (21)                                              /*!< EADC_T::INTSRC3: SPLIE21 Position      */
#define EADC_INTSRC3_SPLIE21_Msk         (0x1ul << EADC_INTSRC3_SPLIE21_Pos)               /*!< EADC_T::INTSRC3: SPLIE21 Mask          */

#define EADC_INTSRC3_SPLIE22_Pos         (22)                                              /*!< EADC_T::INTSRC3: SPLIE22 Position      */
#define EADC_INTSRC3_SPLIE22_Msk         (0x1ul << EADC_INTSRC3_SPLIE22_Pos)               /*!< EADC_T::INTSRC3: SPLIE22 Mask          */

#define EADC_INTSRC3_SPLIE23_Pos         (23)                                              /*!< EADC_T::INTSRC3: SPLIE23 Position      */
#define EADC_INTSRC3_SPLIE23_Msk         (0x1ul << EADC_INTSRC3_SPLIE23_Pos)               /*!< EADC_T::INTSRC3: SPLIE23 Mask          */

#define EADC_INTSRC3_SPLIE24_Pos         (24)                                              /*!< EADC_T::INTSRC3: SPLIE24 Position      */
#define EADC_INTSRC3_SPLIE24_Msk         (0x1ul << EADC_INTSRC3_SPLIE24_Pos)               /*!< EADC_T::INTSRC3: SPLIE24 Mask          */

#define EADC_INTSRC3_SPLIE25_Pos         (25)                                              /*!< EADC_T::INTSRC3: SPLIE25 Position      */
#define EADC_INTSRC3_SPLIE25_Msk         (0x1ul << EADC_INTSRC3_SPLIE25_Pos)               /*!< EADC_T::INTSRC3: SPLIE25 Mask          */

#define EADC_INTSRC3_SPLIE26_Pos         (26)                                              /*!< EADC_T::INTSRC3: SPLIE26 Position      */
#define EADC_INTSRC3_SPLIE26_Msk         (0x1ul << EADC_INTSRC3_SPLIE26_Pos)               /*!< EADC_T::INTSRC3: SPLIE26 Mask          */

#define EADC_INTSRC3_SPLIE27_Pos         (27)                                              /*!< EADC_T::INTSRC3: SPLIE27 Position      */
#define EADC_INTSRC3_SPLIE27_Msk         (0x1ul << EADC_INTSRC3_SPLIE27_Pos)               /*!< EADC_T::INTSRC3: SPLIE27 Mask          */

#define EADC_CMP_ADCMPEN_Pos             (0)                                               /*!< EADC_T::CMP: ADCMPEN Position          */
#define EADC_CMP_ADCMPEN_Msk             (0x1ul << EADC_CMP_ADCMPEN_Pos)                   /*!< EADC_T::CMP: ADCMPEN Mask              */

#define EADC_CMP_ADCMPIE_Pos             (1)                                               /*!< EADC_T::CMP: ADCMPIE Position          */
#define EADC_CMP_ADCMPIE_Msk             (0x1ul << EADC_CMP_ADCMPIE_Pos)                   /*!< EADC_T::CMP: ADCMPIE Mask              */

#define EADC_CMP_CMPCOND_Pos             (2)                                               /*!< EADC_T::CMP: CMPCOND Position          */
#define EADC_CMP_CMPCOND_Msk             (0x1ul << EADC_CMP_CMPCOND_Pos)                   /*!< EADC_T::CMP: CMPCOND Mask              */

#define EADC_CMP_CMPSPL_Pos              (3)                                               /*!< EADC_T::CMP: CMPSPL Position           */
#define EADC_CMP_CMPSPL_Msk              (0x1ful << EADC_CMP_CMPSPL_Pos)                   /*!< EADC_T::CMP: CMPSPL Mask               */

#define EADC_CMP_CMPMCNT_Pos             (8)                                               /*!< EADC_T::CMP: CMPMCNT Position          */
#define EADC_CMP_CMPMCNT_Msk             (0xful << EADC_CMP_CMPMCNT_Pos)                   /*!< EADC_T::CMP: CMPMCNT Mask              */

#define EADC_CMP_CMPWEN_Pos              (15)                                              /*!< EADC_T::CMP: CMPWEN Position           */
#define EADC_CMP_CMPWEN_Msk              (0x1ul << EADC_CMP_CMPWEN_Pos)                    /*!< EADC_T::CMP: CMPWEN Mask               */

#define EADC_CMP_CMPDAT_Pos              (16)                                              /*!< EADC_T::CMP: CMPDAT Position           */
#define EADC_CMP_CMPDAT_Msk              (0xffful << EADC_CMP_CMPDAT_Pos)                  /*!< EADC_T::CMP: CMPDAT Mask               */

#define EADC_CMP0_ADCMPEN_Pos            (0)                                               /*!< EADC_T::CMP0: ADCMPEN Position         */
#define EADC_CMP0_ADCMPEN_Msk            (0x1ul << EADC_CMP0_ADCMPEN_Pos)                  /*!< EADC_T::CMP0: ADCMPEN Mask             */

