zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/eadc_reg.h
#define EADC_CALCTL_CALIE_Pos            (1)                                               /*!< EADC_T::CALCTL: CALIE Position         */
#define EADC_CALCTL_CALIE_Msk            (0x1ul << EADC_CALCTL_CALIE_Pos)                  /*!< EADC_T::CALCTL: CALIE Mask             */

#define EADC_CALSR_CALIF_Pos             (16)                                              /*!< EADC_T::CALSR: CALIF Position          */
#define EADC_CALSR_CALIF_Msk             (0x1ul << EADC_CALSR_CALIF_Pos)                   /*!< EADC_T::CALSR: CALIF Mask              */

#define EADC_PDMACTL_PDMATEN_Pos         (0)                                               /*!< EADC_T::PDMACTL: PDMATEN Position      */
#define EADC_PDMACTL_PDMATEN_Msk         (0xffffffful << EADC_PDMACTL_PDMATEN_Pos)         /*!< EADC_T::PDMACTL: PDMATEN Mask          */

#define EADC_MCTL1_ALIGN_Pos             (0)                                               /*!< EADC_T::MCTL1: ALIGN Position          */
#define EADC_MCTL1_ALIGN_Msk             (0x1ul << EADC_MCTL1_ALIGN_Pos)                   /*!< EADC_T::MCTL1: ALIGN Mask              */

#define EADC_MCTL1_AVG_Pos               (1)                                               /*!< EADC_T::MCTL1: AVG Position            */
#define EADC_MCTL1_AVG_Msk               (0x1ul << EADC_MCTL1_AVG_Pos)                     /*!< EADC_T::MCTL1: AVG Mask                */

#define EADC_MCTL1_ACU_Pos               (4)                                               /*!< EADC_T::MCTL1: ACU Position            */
#define EADC_MCTL1_ACU_Msk               (0xful << EADC_MCTL1_ACU_Pos)                     /*!< EADC_T::MCTL1: ACU Mask                */

#define EADC_MCTL1_EXTSTDIV_Pos          (16)                                              /*!< EADC_T::MCTL1: EXTSTDIV Position       */
#define EADC_MCTL1_EXTSTDIV_Msk          (0x3ul << EADC_MCTL1_EXTSTDIV_Pos)                /*!< EADC_T::MCTL1: EXTSTDIV Mask           */

#define EADC_MCTL1_DBMEN_Pos             (20)                                              /*!< EADC_T::MCTL1: DBMEN Position          */
#define EADC_MCTL1_DBMEN_Msk             (0x1ul << EADC_MCTL1_DBMEN_Pos)                   /*!< EADC_T::MCTL1: DBMEN Mask              */

#define EADC_M0CTL1_ALIGN_Pos            (0)                                               /*!< EADC_T::M0CTL1: ALIGN Position         */
#define EADC_M0CTL1_ALIGN_Msk            (0x1ul << EADC_M0CTL1_ALIGN_Pos)                  /*!< EADC_T::M0CTL1: ALIGN Mask             */

#define EADC_M0CTL1_AVG_Pos              (1)                                               /*!< EADC_T::M0CTL1: AVG Position           */
#define EADC_M0CTL1_AVG_Msk              (0x1ul << EADC_M0CTL1_AVG_Pos)                    /*!< EADC_T::M0CTL1: AVG Mask               */

#define EADC_M0CTL1_ACU_Pos              (4)                                               /*!< EADC_T::M0CTL1: ACU Position           */
#define EADC_M0CTL1_ACU_Msk              (0xful << EADC_M0CTL1_ACU_Pos)                    /*!< EADC_T::M0CTL1: ACU Mask               */

#define EADC_M0CTL1_EXTSTDIV_Pos         (16)                                              /*!< EADC_T::M0CTL1: EXTSTDIV Position      */
#define EADC_M0CTL1_EXTSTDIV_Msk         (0x3ul << EADC_M0CTL1_EXTSTDIV_Pos)               /*!< EADC_T::M0CTL1: EXTSTDIV Mask          */

#define EADC_M0CTL1_DBMEN_Pos            (20)                                              /*!< EADC_T::M0CTL1: DBMEN Position         */
#define EADC_M0CTL1_DBMEN_Msk            (0x1ul << EADC_M0CTL1_DBMEN_Pos)                  /*!< EADC_T::M0CTL1: DBMEN Mask             */

#define EADC_M1CTL1_ALIGN_Pos            (0)                                               /*!< EADC_T::M1CTL1: ALIGN Position         */
#define EADC_M1CTL1_ALIGN_Msk            (0x1ul << EADC_M1CTL1_ALIGN_Pos)                  /*!< EADC_T::M1CTL1: ALIGN Mask             */

#define EADC_M1CTL1_AVG_Pos              (1)                                               /*!< EADC_T::M1CTL1: AVG Position           */
#define EADC_M1CTL1_AVG_Msk              (0x1ul << EADC_M1CTL1_AVG_Pos)                    /*!< EADC_T::M1CTL1: AVG Mask               */

#define EADC_M1CTL1_ACU_Pos              (4)                                               /*!< EADC_T::M1CTL1: ACU Position           */
#define EADC_M1CTL1_ACU_Msk              (0xful << EADC_M1CTL1_ACU_Pos)                    /*!< EADC_T::M1CTL1: ACU Mask               */

#define EADC_M1CTL1_EXTSTDIV_Pos         (16)                                              /*!< EADC_T::M1CTL1: EXTSTDIV Position      */
#define EADC_M1CTL1_EXTSTDIV_Msk         (0x3ul << EADC_M1CTL1_EXTSTDIV_Pos)               /*!< EADC_T::M1CTL1: EXTSTDIV Mask          */

#define EADC_M1CTL1_DBMEN_Pos            (20)                                              /*!< EADC_T::M1CTL1: DBMEN Position         */
#define EADC_M1CTL1_DBMEN_Msk            (0x1ul << EADC_M1CTL1_DBMEN_Pos)                  /*!< EADC_T::M1CTL1: DBMEN Mask             */

#define EADC_M2CTL1_ALIGN_Pos            (0)                                               /*!< EADC_T::M2CTL1: ALIGN Position         */
#define EADC_M2CTL1_ALIGN_Msk            (0x1ul << EADC_M2CTL1_ALIGN_Pos)                  /*!< EADC_T::M2CTL1: ALIGN Mask             */

#define EADC_M2CTL1_AVG_Pos              (1)                                               /*!< EADC_T::M2CTL1: AVG Position           */
#define EADC_M2CTL1_AVG_Msk              (0x1ul << EADC_M2CTL1_AVG_Pos)                    /*!< EADC_T::M2CTL1: AVG Mask               */

#define EADC_M2CTL1_ACU_Pos              (4)                                               /*!< EADC_T::M2CTL1: ACU Position           */
#define EADC_M2CTL1_ACU_Msk              (0xful << EADC_M2CTL1_ACU_Pos)                    /*!< EADC_T::M2CTL1: ACU Mask               */

#define EADC_M2CTL1_EXTSTDIV_Pos         (16)                                              /*!< EADC_T::M2CTL1: EXTSTDIV Position      */
#define EADC_M2CTL1_EXTSTDIV_Msk         (0x3ul << EADC_M2CTL1_EXTSTDIV_Pos)               /*!< EADC_T::M2CTL1: EXTSTDIV Mask          */

