zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/eadc_reg.h
#define EADC_M2CTL1_DBMEN_Pos            (20)                                              /*!< EADC_T::M2CTL1: DBMEN Position         */
#define EADC_M2CTL1_DBMEN_Msk            (0x1ul << EADC_M2CTL1_DBMEN_Pos)                  /*!< EADC_T::M2CTL1: DBMEN Mask             */

#define EADC_M3CTL1_ALIGN_Pos            (0)                                               /*!< EADC_T::M3CTL1: ALIGN Position         */
#define EADC_M3CTL1_ALIGN_Msk            (0x1ul << EADC_M3CTL1_ALIGN_Pos)                  /*!< EADC_T::M3CTL1: ALIGN Mask             */

#define EADC_M3CTL1_AVG_Pos              (1)                                               /*!< EADC_T::M3CTL1: AVG Position           */
#define EADC_M3CTL1_AVG_Msk              (0x1ul << EADC_M3CTL1_AVG_Pos)                    /*!< EADC_T::M3CTL1: AVG Mask               */

#define EADC_M3CTL1_ACU_Pos              (4)                                               /*!< EADC_T::M3CTL1: ACU Position           */
#define EADC_M3CTL1_ACU_Msk              (0xful << EADC_M3CTL1_ACU_Pos)                    /*!< EADC_T::M3CTL1: ACU Mask               */

#define EADC_M3CTL1_EXTSTDIV_Pos         (16)                                              /*!< EADC_T::M3CTL1: EXTSTDIV Position      */
#define EADC_M3CTL1_EXTSTDIV_Msk         (0x3ul << EADC_M3CTL1_EXTSTDIV_Pos)               /*!< EADC_T::M3CTL1: EXTSTDIV Mask          */

#define EADC_M3CTL1_DBMEN_Pos            (20)                                              /*!< EADC_T::M3CTL1: DBMEN Position         */
#define EADC_M3CTL1_DBMEN_Msk            (0x1ul << EADC_M3CTL1_DBMEN_Pos)                  /*!< EADC_T::M3CTL1: DBMEN Mask             */

#define EADC_M4CTL1_ALIGN_Pos            (0)                                               /*!< EADC_T::M4CTL1: ALIGN Position         */
#define EADC_M4CTL1_ALIGN_Msk            (0x1ul << EADC_M4CTL1_ALIGN_Pos)                  /*!< EADC_T::M4CTL1: ALIGN Mask             */

#define EADC_M4CTL1_AVG_Pos              (1)                                               /*!< EADC_T::M4CTL1: AVG Position           */
#define EADC_M4CTL1_AVG_Msk              (0x1ul << EADC_M4CTL1_AVG_Pos)                    /*!< EADC_T::M4CTL1: AVG Mask               */

#define EADC_M4CTL1_ACU_Pos              (4)                                               /*!< EADC_T::M4CTL1: ACU Position           */
#define EADC_M4CTL1_ACU_Msk              (0xful << EADC_M4CTL1_ACU_Pos)                    /*!< EADC_T::M4CTL1: ACU Mask               */

#define EADC_M4CTL1_EXTSTDIV_Pos         (16)                                              /*!< EADC_T::M4CTL1: EXTSTDIV Position      */
#define EADC_M4CTL1_EXTSTDIV_Msk         (0x3ul << EADC_M4CTL1_EXTSTDIV_Pos)               /*!< EADC_T::M4CTL1: EXTSTDIV Mask          */

#define EADC_M5CTL1_ALIGN_Pos            (0)                                               /*!< EADC_T::M5CTL1: ALIGN Position         */
#define EADC_M5CTL1_ALIGN_Msk            (0x1ul << EADC_M5CTL1_ALIGN_Pos)                  /*!< EADC_T::M5CTL1: ALIGN Mask             */

#define EADC_M5CTL1_AVG_Pos              (1)                                               /*!< EADC_T::M5CTL1: AVG Position           */
#define EADC_M5CTL1_AVG_Msk              (0x1ul << EADC_M5CTL1_AVG_Pos)                    /*!< EADC_T::M5CTL1: AVG Mask               */

#define EADC_M5CTL1_ACU_Pos              (4)                                               /*!< EADC_T::M5CTL1: ACU Position           */
#define EADC_M5CTL1_ACU_Msk              (0xful << EADC_M5CTL1_ACU_Pos)                    /*!< EADC_T::M5CTL1: ACU Mask               */

#define EADC_M5CTL1_EXTSTDIV_Pos         (16)                                              /*!< EADC_T::M5CTL1: EXTSTDIV Position      */
#define EADC_M5CTL1_EXTSTDIV_Msk         (0x3ul << EADC_M5CTL1_EXTSTDIV_Pos)               /*!< EADC_T::M5CTL1: EXTSTDIV Mask          */

#define EADC_M6CTL1_ALIGN_Pos            (0)                                               /*!< EADC_T::M6CTL1: ALIGN Position         */
#define EADC_M6CTL1_ALIGN_Msk            (0x1ul << EADC_M6CTL1_ALIGN_Pos)                  /*!< EADC_T::M6CTL1: ALIGN Mask             */

#define EADC_M6CTL1_AVG_Pos              (1)                                               /*!< EADC_T::M6CTL1: AVG Position           */
#define EADC_M6CTL1_AVG_Msk              (0x1ul << EADC_M6CTL1_AVG_Pos)                    /*!< EADC_T::M6CTL1: AVG Mask               */

#define EADC_M6CTL1_ACU_Pos              (4)                                               /*!< EADC_T::M6CTL1: ACU Position           */
#define EADC_M6CTL1_ACU_Msk              (0xful << EADC_M6CTL1_ACU_Pos)                    /*!< EADC_T::M6CTL1: ACU Mask               */

#define EADC_M6CTL1_EXTSTDIV_Pos         (16)                                              /*!< EADC_T::M6CTL1: EXTSTDIV Position      */
#define EADC_M6CTL1_EXTSTDIV_Msk         (0x3ul << EADC_M6CTL1_EXTSTDIV_Pos)               /*!< EADC_T::M6CTL1: EXTSTDIV Mask          */

#define EADC_M7CTL1_ALIGN_Pos            (0)                                               /*!< EADC_T::M7CTL1: ALIGN Position         */
#define EADC_M7CTL1_ALIGN_Msk            (0x1ul << EADC_M7CTL1_ALIGN_Pos)                  /*!< EADC_T::M7CTL1: ALIGN Mask             */

#define EADC_M7CTL1_AVG_Pos              (1)                                               /*!< EADC_T::M7CTL1: AVG Position           */
#define EADC_M7CTL1_AVG_Msk              (0x1ul << EADC_M7CTL1_AVG_Pos)                    /*!< EADC_T::M7CTL1: AVG Mask               */

#define EADC_M7CTL1_ACU_Pos              (4)                                               /*!< EADC_T::M7CTL1: ACU Position           */
#define EADC_M7CTL1_ACU_Msk              (0xful << EADC_M7CTL1_ACU_Pos)                    /*!< EADC_T::M7CTL1: ACU Mask               */

#define EADC_M7CTL1_EXTSTDIV_Pos         (16)                                              /*!< EADC_T::M7CTL1: EXTSTDIV Position      */
#define EADC_M7CTL1_EXTSTDIV_Msk         (0x3ul << EADC_M7CTL1_EXTSTDIV_Pos)               /*!< EADC_T::M7CTL1: EXTSTDIV Mask          */

