zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/eadc_reg.h
#define EADC_M8CTL1_ALIGN_Pos            (0)                                               /*!< EADC_T::M8CTL1: ALIGN Position         */
#define EADC_M8CTL1_ALIGN_Msk            (0x1ul << EADC_M8CTL1_ALIGN_Pos)                  /*!< EADC_T::M8CTL1: ALIGN Mask             */

#define EADC_M8CTL1_AVG_Pos              (1)                                               /*!< EADC_T::M8CTL1: AVG Position           */
#define EADC_M8CTL1_AVG_Msk              (0x1ul << EADC_M8CTL1_AVG_Pos)                    /*!< EADC_T::M8CTL1: AVG Mask               */

#define EADC_M8CTL1_ACU_Pos              (4)                                               /*!< EADC_T::M8CTL1: ACU Position           */
#define EADC_M8CTL1_ACU_Msk              (0xful << EADC_M8CTL1_ACU_Pos)                    /*!< EADC_T::M8CTL1: ACU Mask               */

#define EADC_M8CTL1_EXTSTDIV_Pos         (16)                                              /*!< EADC_T::M8CTL1: EXTSTDIV Position      */
#define EADC_M8CTL1_EXTSTDIV_Msk         (0x3ul << EADC_M8CTL1_EXTSTDIV_Pos)               /*!< EADC_T::M8CTL1: EXTSTDIV Mask          */

#define EADC_M9CTL1_ALIGN_Pos            (0)                                               /*!< EADC_T::M9CTL1: ALIGN Position         */
#define EADC_M9CTL1_ALIGN_Msk            (0x1ul << EADC_M9CTL1_ALIGN_Pos)                  /*!< EADC_T::M9CTL1: ALIGN Mask             */

#define EADC_M9CTL1_AVG_Pos              (1)                                               /*!< EADC_T::M9CTL1: AVG Position           */
#define EADC_M9CTL1_AVG_Msk              (0x1ul << EADC_M9CTL1_AVG_Pos)                    /*!< EADC_T::M9CTL1: AVG Mask               */

#define EADC_M9CTL1_ACU_Pos              (4)                                               /*!< EADC_T::M9CTL1: ACU Position           */
#define EADC_M9CTL1_ACU_Msk              (0xful << EADC_M9CTL1_ACU_Pos)                    /*!< EADC_T::M9CTL1: ACU Mask               */

#define EADC_M9CTL1_EXTSTDIV_Pos         (16)                                              /*!< EADC_T::M9CTL1: EXTSTDIV Position      */
#define EADC_M9CTL1_EXTSTDIV_Msk         (0x3ul << EADC_M9CTL1_EXTSTDIV_Pos)               /*!< EADC_T::M9CTL1: EXTSTDIV Mask          */

#define EADC_M10CTL1_ALIGN_Pos           (0)                                               /*!< EADC_T::M10CTL1: ALIGN Position        */
#define EADC_M10CTL1_ALIGN_Msk           (0x1ul << EADC_M10CTL1_ALIGN_Pos)                 /*!< EADC_T::M10CTL1: ALIGN Mask            */

#define EADC_M10CTL1_AVG_Pos             (1)                                               /*!< EADC_T::M10CTL1: AVG Position          */
#define EADC_M10CTL1_AVG_Msk             (0x1ul << EADC_M10CTL1_AVG_Pos)                   /*!< EADC_T::M10CTL1: AVG Mask              */

#define EADC_M10CTL1_ACU_Pos             (4)                                               /*!< EADC_T::M10CTL1: ACU Position          */
#define EADC_M10CTL1_ACU_Msk             (0xful << EADC_M10CTL1_ACU_Pos)                   /*!< EADC_T::M10CTL1: ACU Mask              */

#define EADC_M10CTL1_EXTSTDIV_Pos        (16)                                              /*!< EADC_T::M10CTL1: EXTSTDIV Position     */
#define EADC_M10CTL1_EXTSTDIV_Msk        (0x3ul << EADC_M10CTL1_EXTSTDIV_Pos)              /*!< EADC_T::M10CTL1: EXTSTDIV Mask         */

#define EADC_M11CTL1_ALIGN_Pos           (0)                                               /*!< EADC_T::M11CTL1: ALIGN Position        */
#define EADC_M11CTL1_ALIGN_Msk           (0x1ul << EADC_M11CTL1_ALIGN_Pos)                 /*!< EADC_T::M11CTL1: ALIGN Mask            */

#define EADC_M11CTL1_AVG_Pos             (1)                                               /*!< EADC_T::M11CTL1: AVG Position          */
#define EADC_M11CTL1_AVG_Msk             (0x1ul << EADC_M11CTL1_AVG_Pos)                   /*!< EADC_T::M11CTL1: AVG Mask              */

#define EADC_M11CTL1_ACU_Pos             (4)                                               /*!< EADC_T::M11CTL1: ACU Position          */
#define EADC_M11CTL1_ACU_Msk             (0xful << EADC_M11CTL1_ACU_Pos)                   /*!< EADC_T::M11CTL1: ACU Mask              */

#define EADC_M11CTL1_EXTSTDIV_Pos        (16)                                              /*!< EADC_T::M11CTL1: EXTSTDIV Position     */
#define EADC_M11CTL1_EXTSTDIV_Msk        (0x3ul << EADC_M11CTL1_EXTSTDIV_Pos)              /*!< EADC_T::M11CTL1: EXTSTDIV Mask         */

#define EADC_M12CTL1_ALIGN_Pos           (0)                                               /*!< EADC_T::M12CTL1: ALIGN Position        */
#define EADC_M12CTL1_ALIGN_Msk           (0x1ul << EADC_M12CTL1_ALIGN_Pos)                 /*!< EADC_T::M12CTL1: ALIGN Mask            */

#define EADC_M12CTL1_AVG_Pos             (1)                                               /*!< EADC_T::M12CTL1: AVG Position          */
#define EADC_M12CTL1_AVG_Msk             (0x1ul << EADC_M12CTL1_AVG_Pos)                   /*!< EADC_T::M12CTL1: AVG Mask              */

#define EADC_M12CTL1_ACU_Pos             (4)                                               /*!< EADC_T::M12CTL1: ACU Position          */
#define EADC_M12CTL1_ACU_Msk             (0xful << EADC_M12CTL1_ACU_Pos)                   /*!< EADC_T::M12CTL1: ACU Mask              */

#define EADC_M12CTL1_EXTSTDIV_Pos        (16)                                              /*!< EADC_T::M12CTL1: EXTSTDIV Position     */
#define EADC_M12CTL1_EXTSTDIV_Msk        (0x3ul << EADC_M12CTL1_EXTSTDIV_Pos)              /*!< EADC_T::M12CTL1: EXTSTDIV Mask         */

#define EADC_M13CTL1_ALIGN_Pos           (0)                                               /*!< EADC_T::M13CTL1: ALIGN Position        */
#define EADC_M13CTL1_ALIGN_Msk           (0x1ul << EADC_M13CTL1_ALIGN_Pos)                 /*!< EADC_T::M13CTL1: ALIGN Mask            */

#define EADC_M13CTL1_AVG_Pos             (1)                                               /*!< EADC_T::M13CTL1: AVG Position          */
#define EADC_M13CTL1_AVG_Msk             (0x1ul << EADC_M13CTL1_AVG_Pos)                   /*!< EADC_T::M13CTL1: AVG Mask              */

