zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/eadc_reg.h
#define EADC_M13CTL1_ACU_Pos             (4)                                               /*!< EADC_T::M13CTL1: ACU Position          */
#define EADC_M13CTL1_ACU_Msk             (0xful << EADC_M13CTL1_ACU_Pos)                   /*!< EADC_T::M13CTL1: ACU Mask              */

#define EADC_M13CTL1_EXTSTDIV_Pos        (16)                                              /*!< EADC_T::M13CTL1: EXTSTDIV Position     */
#define EADC_M13CTL1_EXTSTDIV_Msk        (0x3ul << EADC_M13CTL1_EXTSTDIV_Pos)              /*!< EADC_T::M13CTL1: EXTSTDIV Mask         */

#define EADC_M14CTL1_ALIGN_Pos           (0)                                               /*!< EADC_T::M14CTL1: ALIGN Position        */
#define EADC_M14CTL1_ALIGN_Msk           (0x1ul << EADC_M14CTL1_ALIGN_Pos)                 /*!< EADC_T::M14CTL1: ALIGN Mask            */

#define EADC_M14CTL1_AVG_Pos             (1)                                               /*!< EADC_T::M14CTL1: AVG Position          */
#define EADC_M14CTL1_AVG_Msk             (0x1ul << EADC_M14CTL1_AVG_Pos)                   /*!< EADC_T::M14CTL1: AVG Mask              */

#define EADC_M14CTL1_ACU_Pos             (4)                                               /*!< EADC_T::M14CTL1: ACU Position          */
#define EADC_M14CTL1_ACU_Msk             (0xful << EADC_M14CTL1_ACU_Pos)                   /*!< EADC_T::M14CTL1: ACU Mask              */

#define EADC_M14CTL1_EXTSTDIV_Pos        (16)                                              /*!< EADC_T::M14CTL1: EXTSTDIV Position     */
#define EADC_M14CTL1_EXTSTDIV_Msk        (0x3ul << EADC_M14CTL1_EXTSTDIV_Pos)              /*!< EADC_T::M14CTL1: EXTSTDIV Mask         */

#define EADC_M15CTL1_ALIGN_Pos           (0)                                               /*!< EADC_T::M15CTL1: ALIGN Position        */
#define EADC_M15CTL1_ALIGN_Msk           (0x1ul << EADC_M15CTL1_ALIGN_Pos)                 /*!< EADC_T::M15CTL1: ALIGN Mask            */

#define EADC_M15CTL1_AVG_Pos             (1)                                               /*!< EADC_T::M15CTL1: AVG Position          */
#define EADC_M15CTL1_AVG_Msk             (0x1ul << EADC_M15CTL1_AVG_Pos)                   /*!< EADC_T::M15CTL1: AVG Mask              */

#define EADC_M15CTL1_ACU_Pos             (4)                                               /*!< EADC_T::M15CTL1: ACU Position          */
#define EADC_M15CTL1_ACU_Msk             (0xful << EADC_M15CTL1_ACU_Pos)                   /*!< EADC_T::M15CTL1: ACU Mask              */

#define EADC_M15CTL1_EXTSTDIV_Pos        (16)                                              /*!< EADC_T::M15CTL1: EXTSTDIV Position     */
#define EADC_M15CTL1_EXTSTDIV_Msk        (0x3ul << EADC_M15CTL1_EXTSTDIV_Pos)              /*!< EADC_T::M15CTL1: EXTSTDIV Mask         */

#define EADC_M16CTL1_ALIGN_Pos           (0)                                               /*!< EADC_T::M16CTL1: ALIGN Position        */
#define EADC_M16CTL1_ALIGN_Msk           (0x1ul << EADC_M16CTL1_ALIGN_Pos)                 /*!< EADC_T::M16CTL1: ALIGN Mask            */

#define EADC_M16CTL1_AVG_Pos             (1)                                               /*!< EADC_T::M16CTL1: AVG Position          */
#define EADC_M16CTL1_AVG_Msk             (0x1ul << EADC_M16CTL1_AVG_Pos)                   /*!< EADC_T::M16CTL1: AVG Mask              */

#define EADC_M16CTL1_ACU_Pos             (4)                                               /*!< EADC_T::M16CTL1: ACU Position          */
#define EADC_M16CTL1_ACU_Msk             (0xful << EADC_M16CTL1_ACU_Pos)                   /*!< EADC_T::M16CTL1: ACU Mask              */

#define EADC_M16CTL1_EXTSTDIV_Pos        (16)                                              /*!< EADC_T::M16CTL1: EXTSTDIV Position     */
#define EADC_M16CTL1_EXTSTDIV_Msk        (0x3ul << EADC_M16CTL1_EXTSTDIV_Pos)              /*!< EADC_T::M16CTL1: EXTSTDIV Mask         */

#define EADC_M17CTL1_ALIGN_Pos           (0)                                               /*!< EADC_T::M17CTL1: ALIGN Position        */
#define EADC_M17CTL1_ALIGN_Msk           (0x1ul << EADC_M17CTL1_ALIGN_Pos)                 /*!< EADC_T::M17CTL1: ALIGN Mask            */

#define EADC_M17CTL1_AVG_Pos             (1)                                               /*!< EADC_T::M17CTL1: AVG Position          */
#define EADC_M17CTL1_AVG_Msk             (0x1ul << EADC_M17CTL1_AVG_Pos)                   /*!< EADC_T::M17CTL1: AVG Mask              */

#define EADC_M17CTL1_ACU_Pos             (4)                                               /*!< EADC_T::M17CTL1: ACU Position          */
#define EADC_M17CTL1_ACU_Msk             (0xful << EADC_M17CTL1_ACU_Pos)                   /*!< EADC_T::M17CTL1: ACU Mask              */

#define EADC_M17CTL1_EXTSTDIV_Pos        (16)                                              /*!< EADC_T::M17CTL1: EXTSTDIV Position     */
#define EADC_M17CTL1_EXTSTDIV_Msk        (0x3ul << EADC_M17CTL1_EXTSTDIV_Pos)              /*!< EADC_T::M17CTL1: EXTSTDIV Mask         */

#define EADC_M18CTL1_ALIGN_Pos           (0)                                               /*!< EADC_T::M18CTL1: ALIGN Position        */
#define EADC_M18CTL1_ALIGN_Msk           (0x1ul << EADC_M18CTL1_ALIGN_Pos)                 /*!< EADC_T::M18CTL1: ALIGN Mask            */

#define EADC_M18CTL1_AVG_Pos             (1)                                               /*!< EADC_T::M18CTL1: AVG Position          */
#define EADC_M18CTL1_AVG_Msk             (0x1ul << EADC_M18CTL1_AVG_Pos)                   /*!< EADC_T::M18CTL1: AVG Mask              */

#define EADC_M18CTL1_ACU_Pos             (4)                                               /*!< EADC_T::M18CTL1: ACU Position          */
#define EADC_M18CTL1_ACU_Msk             (0xful << EADC_M18CTL1_ACU_Pos)                   /*!< EADC_T::M18CTL1: ACU Mask              */

#define EADC_M18CTL1_EXTSTDIV_Pos        (16)                                              /*!< EADC_T::M18CTL1: EXTSTDIV Position     */
#define EADC_M18CTL1_EXTSTDIV_Msk        (0x3ul << EADC_M18CTL1_EXTSTDIV_Pos)              /*!< EADC_T::M18CTL1: EXTSTDIV Mask         */

#define EADC_DAT19_RESULT_Pos            (0)                                               /*!< EADC_T::DAT19: RESULT Position         */
#define EADC_DAT19_RESULT_Msk            (0xfffful << EADC_DAT19_RESULT_Pos)               /*!< EADC_T::DAT19: RESULT Mask             */

#define EADC_DAT19_OV_Pos                (16)                                              /*!< EADC_T::DAT19: OV Position             */
#define EADC_DAT19_OV_Msk                (0x1ul << EADC_DAT19_OV_Pos)                      /*!< EADC_T::DAT19: OV Mask                 */

#define EADC_DAT19_VALID_Pos             (17)                                              /*!< EADC_T::DAT19: VALID Position          */
#define EADC_DAT19_VALID_Msk             (0x1ul << EADC_DAT19_VALID_Pos)                   /*!< EADC_T::DAT19: VALID Mask              */

#define EADC_DAT20_RESULT_Pos            (0)                                               /*!< EADC_T::DAT20: RESULT Position         */
#define EADC_DAT20_RESULT_Msk            (0xfffful << EADC_DAT20_RESULT_Pos)               /*!< EADC_T::DAT20: RESULT Mask             */

#define EADC_DAT20_OV_Pos                (16)                                              /*!< EADC_T::DAT20: OV Position             */
#define EADC_DAT20_OV_Msk                (0x1ul << EADC_DAT20_OV_Pos)                      /*!< EADC_T::DAT20: OV Mask                 */

#define EADC_DAT20_VALID_Pos             (17)                                              /*!< EADC_T::DAT20: VALID Position          */
#define EADC_DAT20_VALID_Msk             (0x1ul << EADC_DAT20_VALID_Pos)                   /*!< EADC_T::DAT20: VALID Mask              */

#define EADC_DAT21_RESULT_Pos            (0)                                               /*!< EADC_T::DAT21: RESULT Position         */
#define EADC_DAT21_RESULT_Msk            (0xfffful << EADC_DAT21_RESULT_Pos)               /*!< EADC_T::DAT21: RESULT Mask             */

