zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/eadc_reg.h
#define EADC_DAT21_OV_Pos                (16)                                              /*!< EADC_T::DAT21: OV Position             */
#define EADC_DAT21_OV_Msk                (0x1ul << EADC_DAT21_OV_Pos)                      /*!< EADC_T::DAT21: OV Mask                 */

#define EADC_DAT21_VALID_Pos             (17)                                              /*!< EADC_T::DAT21: VALID Position          */
#define EADC_DAT21_VALID_Msk             (0x1ul << EADC_DAT21_VALID_Pos)                   /*!< EADC_T::DAT21: VALID Mask              */

#define EADC_DAT22_RESULT_Pos            (0)                                               /*!< EADC_T::DAT22: RESULT Position         */
#define EADC_DAT22_RESULT_Msk            (0xfffful << EADC_DAT22_RESULT_Pos)               /*!< EADC_T::DAT22: RESULT Mask             */

#define EADC_DAT22_OV_Pos                (16)                                              /*!< EADC_T::DAT22: OV Position             */
#define EADC_DAT22_OV_Msk                (0x1ul << EADC_DAT22_OV_Pos)                      /*!< EADC_T::DAT22: OV Mask                 */

#define EADC_DAT22_VALID_Pos             (17)                                              /*!< EADC_T::DAT22: VALID Position          */
#define EADC_DAT22_VALID_Msk             (0x1ul << EADC_DAT22_VALID_Pos)                   /*!< EADC_T::DAT22: VALID Mask              */

#define EADC_DAT23_RESULT_Pos            (0)                                               /*!< EADC_T::DAT23: RESULT Position         */
#define EADC_DAT23_RESULT_Msk            (0xfffful << EADC_DAT23_RESULT_Pos)               /*!< EADC_T::DAT23: RESULT Mask             */

#define EADC_DAT23_OV_Pos                (16)                                              /*!< EADC_T::DAT23: OV Position             */
#define EADC_DAT23_OV_Msk                (0x1ul << EADC_DAT23_OV_Pos)                      /*!< EADC_T::DAT23: OV Mask                 */

#define EADC_DAT23_VALID_Pos             (17)                                              /*!< EADC_T::DAT23: VALID Position          */
#define EADC_DAT23_VALID_Msk             (0x1ul << EADC_DAT23_VALID_Pos)                   /*!< EADC_T::DAT23: VALID Mask              */

#define EADC_DAT24_RESULT_Pos            (0)                                               /*!< EADC_T::DAT24: RESULT Position         */
#define EADC_DAT24_RESULT_Msk            (0xfffful << EADC_DAT24_RESULT_Pos)               /*!< EADC_T::DAT24: RESULT Mask             */

#define EADC_DAT24_OV_Pos                (16)                                              /*!< EADC_T::DAT24: OV Position             */
#define EADC_DAT24_OV_Msk                (0x1ul << EADC_DAT24_OV_Pos)                      /*!< EADC_T::DAT24: OV Mask                 */

#define EADC_DAT24_VALID_Pos             (17)                                              /*!< EADC_T::DAT24: VALID Position          */
#define EADC_DAT24_VALID_Msk             (0x1ul << EADC_DAT24_VALID_Pos)                   /*!< EADC_T::DAT24: VALID Mask              */

#define EADC_DAT25_RESULT_Pos            (0)                                               /*!< EADC_T::DAT25: RESULT Position         */
#define EADC_DAT25_RESULT_Msk            (0xfffful << EADC_DAT25_RESULT_Pos)               /*!< EADC_T::DAT25: RESULT Mask             */

#define EADC_DAT25_OV_Pos                (16)                                              /*!< EADC_T::DAT25: OV Position             */
#define EADC_DAT25_OV_Msk                (0x1ul << EADC_DAT25_OV_Pos)                      /*!< EADC_T::DAT25: OV Mask                 */

#define EADC_DAT25_VALID_Pos             (17)                                              /*!< EADC_T::DAT25: VALID Position          */
#define EADC_DAT25_VALID_Msk             (0x1ul << EADC_DAT25_VALID_Pos)                   /*!< EADC_T::DAT25: VALID Mask              */

#define EADC_DAT26_RESULT_Pos            (0)                                               /*!< EADC_T::DAT26: RESULT Position         */
#define EADC_DAT26_RESULT_Msk            (0xfffful << EADC_DAT26_RESULT_Pos)               /*!< EADC_T::DAT26: RESULT Mask             */

#define EADC_DAT26_OV_Pos                (16)                                              /*!< EADC_T::DAT26: OV Position             */
#define EADC_DAT26_OV_Msk                (0x1ul << EADC_DAT26_OV_Pos)                      /*!< EADC_T::DAT26: OV Mask                 */

#define EADC_DAT26_VALID_Pos             (17)                                              /*!< EADC_T::DAT26: VALID Position          */
#define EADC_DAT26_VALID_Msk             (0x1ul << EADC_DAT26_VALID_Pos)                   /*!< EADC_T::DAT26: VALID Mask              */

#define EADC_DAT27_RESULT_Pos            (0)                                               /*!< EADC_T::DAT27: RESULT Position         */
#define EADC_DAT27_RESULT_Msk            (0xfffful << EADC_DAT27_RESULT_Pos)               /*!< EADC_T::DAT27: RESULT Mask             */

#define EADC_DAT27_OV_Pos                (16)                                              /*!< EADC_T::DAT27: OV Position             */
#define EADC_DAT27_OV_Msk                (0x1ul << EADC_DAT27_OV_Pos)                      /*!< EADC_T::DAT27: OV Mask                 */

#define EADC_DAT27_VALID_Pos             (17)                                              /*!< EADC_T::DAT27: VALID Position          */
#define EADC_DAT27_VALID_Msk             (0x1ul << EADC_DAT27_VALID_Pos)                   /*!< EADC_T::DAT27: VALID Mask              */

#define EADC_SCTL19_CHSEL_Pos            (0)                                               /*!< EADC_T::SCTL19: CHSEL Position         */
#define EADC_SCTL19_CHSEL_Msk            (0x1ful << EADC_SCTL19_CHSEL_Pos)                 /*!< EADC_T::SCTL19: CHSEL Mask             */

#define EADC_SCTL19_INTPOS_Pos           (5)                                               /*!< EADC_T::SCTL19: INTPOS Position        */
#define EADC_SCTL19_INTPOS_Msk           (0x1ul << EADC_SCTL19_INTPOS_Pos)                 /*!< EADC_T::SCTL19: INTPOS Mask            */

