zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/eadc_reg.h
#define EADC_SCTL19_TRGDLDIV_Pos         (6)                                               /*!< EADC_T::SCTL19: TRGDLDIV Position      */
#define EADC_SCTL19_TRGDLDIV_Msk         (0x3ul << EADC_SCTL19_TRGDLDIV_Pos)               /*!< EADC_T::SCTL19: TRGDLDIV Mask          */

#define EADC_SCTL19_TRGDLCNT_Pos         (8)                                               /*!< EADC_T::SCTL19: TRGDLCNT Position      */
#define EADC_SCTL19_TRGDLCNT_Msk         (0xfful << EADC_SCTL19_TRGDLCNT_Pos)              /*!< EADC_T::SCTL19: TRGDLCNT Mask          */

#define EADC_SCTL19_TRGSEL_Pos           (16)                                              /*!< EADC_T::SCTL19: TRGSEL Position        */
#define EADC_SCTL19_TRGSEL_Msk           (0x3ful << EADC_SCTL19_TRGSEL_Pos)                /*!< EADC_T::SCTL19: TRGSEL Mask            */

#define EADC_SCTL19_EXTREN_Pos           (22)                                              /*!< EADC_T::SCTL19: EXTREN Position        */
#define EADC_SCTL19_EXTREN_Msk           (0x1ul << EADC_SCTL19_EXTREN_Pos)                 /*!< EADC_T::SCTL19: EXTREN Mask            */

#define EADC_SCTL19_EXTFEN_Pos           (23)                                              /*!< EADC_T::SCTL19: EXTFEN Position        */
#define EADC_SCTL19_EXTFEN_Msk           (0x1ul << EADC_SCTL19_EXTFEN_Pos)                 /*!< EADC_T::SCTL19: EXTFEN Mask            */

#define EADC_SCTL19_EXTSMPT_Pos          (24)                                              /*!< EADC_T::SCTL19: EXTSMPT Position       */
#define EADC_SCTL19_EXTSMPT_Msk          (0xfful << EADC_SCTL19_EXTSMPT_Pos)               /*!< EADC_T::SCTL19: EXTSMPT Mask           */

#define EADC_SCTL20_CHSEL_Pos            (0)                                               /*!< EADC_T::SCTL20: CHSEL Position         */
#define EADC_SCTL20_CHSEL_Msk            (0x1ful << EADC_SCTL20_CHSEL_Pos)                 /*!< EADC_T::SCTL20: CHSEL Mask             */

#define EADC_SCTL20_INTPOS_Pos           (5)                                               /*!< EADC_T::SCTL20: INTPOS Position        */
#define EADC_SCTL20_INTPOS_Msk           (0x1ul << EADC_SCTL20_INTPOS_Pos)                 /*!< EADC_T::SCTL20: INTPOS Mask            */

#define EADC_SCTL20_TRGDLDIV_Pos         (6)                                               /*!< EADC_T::SCTL20: TRGDLDIV Position      */
#define EADC_SCTL20_TRGDLDIV_Msk         (0x3ul << EADC_SCTL20_TRGDLDIV_Pos)               /*!< EADC_T::SCTL20: TRGDLDIV Mask          */

#define EADC_SCTL20_TRGDLCNT_Pos         (8)                                               /*!< EADC_T::SCTL20: TRGDLCNT Position      */
#define EADC_SCTL20_TRGDLCNT_Msk         (0xfful << EADC_SCTL20_TRGDLCNT_Pos)              /*!< EADC_T::SCTL20: TRGDLCNT Mask          */

#define EADC_SCTL20_TRGSEL_Pos           (16)                                              /*!< EADC_T::SCTL20: TRGSEL Position        */
#define EADC_SCTL20_TRGSEL_Msk           (0x3ful << EADC_SCTL20_TRGSEL_Pos)                /*!< EADC_T::SCTL20: TRGSEL Mask            */

#define EADC_SCTL20_EXTREN_Pos           (22)                                              /*!< EADC_T::SCTL20: EXTREN Position        */
#define EADC_SCTL20_EXTREN_Msk           (0x1ul << EADC_SCTL20_EXTREN_Pos)                 /*!< EADC_T::SCTL20: EXTREN Mask            */

#define EADC_SCTL20_EXTFEN_Pos           (23)                                              /*!< EADC_T::SCTL20: EXTFEN Position        */
#define EADC_SCTL20_EXTFEN_Msk           (0x1ul << EADC_SCTL20_EXTFEN_Pos)                 /*!< EADC_T::SCTL20: EXTFEN Mask            */

#define EADC_SCTL20_EXTSMPT_Pos          (24)                                              /*!< EADC_T::SCTL20: EXTSMPT Position       */
#define EADC_SCTL20_EXTSMPT_Msk          (0xfful << EADC_SCTL20_EXTSMPT_Pos)               /*!< EADC_T::SCTL20: EXTSMPT Mask           */

#define EADC_SCTL21_CHSEL_Pos            (0)                                               /*!< EADC_T::SCTL21: CHSEL Position         */
#define EADC_SCTL21_CHSEL_Msk            (0x1ful << EADC_SCTL21_CHSEL_Pos)                 /*!< EADC_T::SCTL21: CHSEL Mask             */

#define EADC_SCTL21_INTPOS_Pos           (5)                                               /*!< EADC_T::SCTL21: INTPOS Position        */
#define EADC_SCTL21_INTPOS_Msk           (0x1ul << EADC_SCTL21_INTPOS_Pos)                 /*!< EADC_T::SCTL21: INTPOS Mask            */

#define EADC_SCTL21_TRGDLDIV_Pos         (6)                                               /*!< EADC_T::SCTL21: TRGDLDIV Position      */
#define EADC_SCTL21_TRGDLDIV_Msk         (0x3ul << EADC_SCTL21_TRGDLDIV_Pos)               /*!< EADC_T::SCTL21: TRGDLDIV Mask          */

#define EADC_SCTL21_TRGDLCNT_Pos         (8)                                               /*!< EADC_T::SCTL21: TRGDLCNT Position      */
#define EADC_SCTL21_TRGDLCNT_Msk         (0xfful << EADC_SCTL21_TRGDLCNT_Pos)              /*!< EADC_T::SCTL21: TRGDLCNT Mask          */

#define EADC_SCTL21_TRGSEL_Pos           (16)                                              /*!< EADC_T::SCTL21: TRGSEL Position        */
#define EADC_SCTL21_TRGSEL_Msk           (0x3ful << EADC_SCTL21_TRGSEL_Pos)                /*!< EADC_T::SCTL21: TRGSEL Mask            */

#define EADC_SCTL21_EXTREN_Pos           (22)                                              /*!< EADC_T::SCTL21: EXTREN Position        */
#define EADC_SCTL21_EXTREN_Msk           (0x1ul << EADC_SCTL21_EXTREN_Pos)                 /*!< EADC_T::SCTL21: EXTREN Mask            */

#define EADC_SCTL21_EXTFEN_Pos           (23)                                              /*!< EADC_T::SCTL21: EXTFEN Position        */
#define EADC_SCTL21_EXTFEN_Msk           (0x1ul << EADC_SCTL21_EXTFEN_Pos)                 /*!< EADC_T::SCTL21: EXTFEN Mask            */

#define EADC_SCTL21_EXTSMPT_Pos          (24)                                              /*!< EADC_T::SCTL21: EXTSMPT Position       */
#define EADC_SCTL21_EXTSMPT_Msk          (0xfful << EADC_SCTL21_EXTSMPT_Pos)               /*!< EADC_T::SCTL21: EXTSMPT Mask           */

#define EADC_SCTL22_CHSEL_Pos            (0)                                               /*!< EADC_T::SCTL22: CHSEL Position         */
#define EADC_SCTL22_CHSEL_Msk            (0x1ful << EADC_SCTL22_CHSEL_Pos)                 /*!< EADC_T::SCTL22: CHSEL Mask             */

#define EADC_SCTL22_INTPOS_Pos           (5)                                               /*!< EADC_T::SCTL22: INTPOS Position        */
#define EADC_SCTL22_INTPOS_Msk           (0x1ul << EADC_SCTL22_INTPOS_Pos)                 /*!< EADC_T::SCTL22: INTPOS Mask            */

#define EADC_SCTL22_TRGDLDIV_Pos         (6)                                               /*!< EADC_T::SCTL22: TRGDLDIV Position      */
#define EADC_SCTL22_TRGDLDIV_Msk         (0x3ul << EADC_SCTL22_TRGDLDIV_Pos)               /*!< EADC_T::SCTL22: TRGDLDIV Mask          */

#define EADC_SCTL22_TRGDLCNT_Pos         (8)                                               /*!< EADC_T::SCTL22: TRGDLCNT Position      */
#define EADC_SCTL22_TRGDLCNT_Msk         (0xfful << EADC_SCTL22_TRGDLCNT_Pos)              /*!< EADC_T::SCTL22: TRGDLCNT Mask          */

#define EADC_SCTL22_TRGSEL_Pos           (16)                                              /*!< EADC_T::SCTL22: TRGSEL Position        */
#define EADC_SCTL22_TRGSEL_Msk           (0x3ful << EADC_SCTL22_TRGSEL_Pos)                /*!< EADC_T::SCTL22: TRGSEL Mask            */

#define EADC_SCTL22_EXTREN_Pos           (22)                                              /*!< EADC_T::SCTL22: EXTREN Position        */
#define EADC_SCTL22_EXTREN_Msk           (0x1ul << EADC_SCTL22_EXTREN_Pos)                 /*!< EADC_T::SCTL22: EXTREN Mask            */

#define EADC_SCTL22_EXTFEN_Pos           (23)                                              /*!< EADC_T::SCTL22: EXTFEN Position        */
#define EADC_SCTL22_EXTFEN_Msk           (0x1ul << EADC_SCTL22_EXTFEN_Pos)                 /*!< EADC_T::SCTL22: EXTFEN Mask            */

