zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/eadc_reg.h
#define EADC_SCTL22_EXTSMPT_Pos          (24)                                              /*!< EADC_T::SCTL22: EXTSMPT Position       */
#define EADC_SCTL22_EXTSMPT_Msk          (0xfful << EADC_SCTL22_EXTSMPT_Pos)               /*!< EADC_T::SCTL22: EXTSMPT Mask           */

#define EADC_SCTL23_CHSEL_Pos            (0)                                               /*!< EADC_T::SCTL23: CHSEL Position         */
#define EADC_SCTL23_CHSEL_Msk            (0x1ful << EADC_SCTL23_CHSEL_Pos)                 /*!< EADC_T::SCTL23: CHSEL Mask             */

#define EADC_SCTL23_INTPOS_Pos           (5)                                               /*!< EADC_T::SCTL23: INTPOS Position        */
#define EADC_SCTL23_INTPOS_Msk           (0x1ul << EADC_SCTL23_INTPOS_Pos)                 /*!< EADC_T::SCTL23: INTPOS Mask            */

#define EADC_SCTL23_TRGDLDIV_Pos         (6)                                               /*!< EADC_T::SCTL23: TRGDLDIV Position      */
#define EADC_SCTL23_TRGDLDIV_Msk         (0x3ul << EADC_SCTL23_TRGDLDIV_Pos)               /*!< EADC_T::SCTL23: TRGDLDIV Mask          */

#define EADC_SCTL23_TRGDLCNT_Pos         (8)                                               /*!< EADC_T::SCTL23: TRGDLCNT Position      */
#define EADC_SCTL23_TRGDLCNT_Msk         (0xfful << EADC_SCTL23_TRGDLCNT_Pos)              /*!< EADC_T::SCTL23: TRGDLCNT Mask          */

#define EADC_SCTL23_TRGSEL_Pos           (16)                                              /*!< EADC_T::SCTL23: TRGSEL Position        */
#define EADC_SCTL23_TRGSEL_Msk           (0x3ful << EADC_SCTL23_TRGSEL_Pos)                /*!< EADC_T::SCTL23: TRGSEL Mask            */

#define EADC_SCTL23_EXTREN_Pos           (22)                                              /*!< EADC_T::SCTL23: EXTREN Position        */
#define EADC_SCTL23_EXTREN_Msk           (0x1ul << EADC_SCTL23_EXTREN_Pos)                 /*!< EADC_T::SCTL23: EXTREN Mask            */

#define EADC_SCTL23_EXTFEN_Pos           (23)                                              /*!< EADC_T::SCTL23: EXTFEN Position        */
#define EADC_SCTL23_EXTFEN_Msk           (0x1ul << EADC_SCTL23_EXTFEN_Pos)                 /*!< EADC_T::SCTL23: EXTFEN Mask            */

#define EADC_SCTL23_EXTSMPT_Pos          (24)                                              /*!< EADC_T::SCTL23: EXTSMPT Position       */
#define EADC_SCTL23_EXTSMPT_Msk          (0xfful << EADC_SCTL23_EXTSMPT_Pos)               /*!< EADC_T::SCTL23: EXTSMPT Mask           */

#define EADC_SCTL24_EXTSMPT_Pos          (24)                                              /*!< EADC_T::SCTL24: EXTSMPT Position       */
#define EADC_SCTL24_EXTSMPT_Msk          (0xfful << EADC_SCTL24_EXTSMPT_Pos)               /*!< EADC_T::SCTL24: EXTSMPT Mask           */

#define EADC_SCTL25_EXTSMPT_Pos          (24)                                              /*!< EADC_T::SCTL25: EXTSMPT Position       */
#define EADC_SCTL25_EXTSMPT_Msk          (0xfful << EADC_SCTL25_EXTSMPT_Pos)               /*!< EADC_T::SCTL25: EXTSMPT Mask           */

#define EADC_SCTL26_EXTSMPT_Pos          (24)                                              /*!< EADC_T::SCTL26: EXTSMPT Position       */
#define EADC_SCTL26_EXTSMPT_Msk          (0xfful << EADC_SCTL26_EXTSMPT_Pos)               /*!< EADC_T::SCTL26: EXTSMPT Mask           */

#define EADC_SCTL27_EXTSMPT_Pos          (24)                                              /*!< EADC_T::SCTL27: EXTSMPT Position       */
#define EADC_SCTL27_EXTSMPT_Msk          (0xfful << EADC_SCTL27_EXTSMPT_Pos)               /*!< EADC_T::SCTL27: EXTSMPT Mask           */

#define EADC_M19CTL1_ALIGN_Pos           (0)                                               /*!< EADC_T::M19CTL1: ALIGN Position        */
#define EADC_M19CTL1_ALIGN_Msk           (0x1ul << EADC_M19CTL1_ALIGN_Pos)                 /*!< EADC_T::M19CTL1: ALIGN Mask            */

#define EADC_M19CTL1_AVG_Pos             (1)                                               /*!< EADC_T::M19CTL1: AVG Position          */
#define EADC_M19CTL1_AVG_Msk             (0x1ul << EADC_M19CTL1_AVG_Pos)                   /*!< EADC_T::M19CTL1: AVG Mask              */

#define EADC_M19CTL1_ACU_Pos             (4)                                               /*!< EADC_T::M19CTL1: ACU Position          */
#define EADC_M19CTL1_ACU_Msk             (0xful << EADC_M19CTL1_ACU_Pos)                   /*!< EADC_T::M19CTL1: ACU Mask              */

#define EADC_M19CTL1_EXTSTDIV_Pos        (16)                                              /*!< EADC_T::M19CTL1: EXTSTDIV Position     */
#define EADC_M19CTL1_EXTSTDIV_Msk        (0x3ul << EADC_M19CTL1_EXTSTDIV_Pos)              /*!< EADC_T::M19CTL1: EXTSTDIV Mask         */

#define EADC_M20CTL1_ALIGN_Pos           (0)                                               /*!< EADC_T::M20CTL1: ALIGN Position        */
#define EADC_M20CTL1_ALIGN_Msk           (0x1ul << EADC_M20CTL1_ALIGN_Pos)                 /*!< EADC_T::M20CTL1: ALIGN Mask            */

#define EADC_M20CTL1_AVG_Pos             (1)                                               /*!< EADC_T::M20CTL1: AVG Position          */
#define EADC_M20CTL1_AVG_Msk             (0x1ul << EADC_M20CTL1_AVG_Pos)                   /*!< EADC_T::M20CTL1: AVG Mask              */

#define EADC_M20CTL1_ACU_Pos             (4)                                               /*!< EADC_T::M20CTL1: ACU Position          */
#define EADC_M20CTL1_ACU_Msk             (0xful << EADC_M20CTL1_ACU_Pos)                   /*!< EADC_T::M20CTL1: ACU Mask              */

#define EADC_M20CTL1_EXTSTDIV_Pos        (16)                                              /*!< EADC_T::M20CTL1: EXTSTDIV Position     */
#define EADC_M20CTL1_EXTSTDIV_Msk        (0x3ul << EADC_M20CTL1_EXTSTDIV_Pos)              /*!< EADC_T::M20CTL1: EXTSTDIV Mask         */

#define EADC_M21CTL1_ALIGN_Pos           (0)                                               /*!< EADC_T::M21CTL1: ALIGN Position        */
#define EADC_M21CTL1_ALIGN_Msk           (0x1ul << EADC_M21CTL1_ALIGN_Pos)                 /*!< EADC_T::M21CTL1: ALIGN Mask            */

#define EADC_M21CTL1_AVG_Pos             (1)                                               /*!< EADC_T::M21CTL1: AVG Position          */
#define EADC_M21CTL1_AVG_Msk             (0x1ul << EADC_M21CTL1_AVG_Pos)                   /*!< EADC_T::M21CTL1: AVG Mask              */

