zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/eadc_reg.h
#define EADC_M21CTL1_ACU_Pos             (4)                                               /*!< EADC_T::M21CTL1: ACU Position          */
#define EADC_M21CTL1_ACU_Msk             (0xful << EADC_M21CTL1_ACU_Pos)                   /*!< EADC_T::M21CTL1: ACU Mask              */

#define EADC_M21CTL1_EXTSTDIV_Pos        (16)                                              /*!< EADC_T::M21CTL1: EXTSTDIV Position     */
#define EADC_M21CTL1_EXTSTDIV_Msk        (0x3ul << EADC_M21CTL1_EXTSTDIV_Pos)              /*!< EADC_T::M21CTL1: EXTSTDIV Mask         */

#define EADC_M22CTL1_ALIGN_Pos           (0)                                               /*!< EADC_T::M22CTL1: ALIGN Position        */
#define EADC_M22CTL1_ALIGN_Msk           (0x1ul << EADC_M22CTL1_ALIGN_Pos)                 /*!< EADC_T::M22CTL1: ALIGN Mask            */

#define EADC_M22CTL1_AVG_Pos             (1)                                               /*!< EADC_T::M22CTL1: AVG Position          */
#define EADC_M22CTL1_AVG_Msk             (0x1ul << EADC_M22CTL1_AVG_Pos)                   /*!< EADC_T::M22CTL1: AVG Mask              */

#define EADC_M22CTL1_ACU_Pos             (4)                                               /*!< EADC_T::M22CTL1: ACU Position          */
#define EADC_M22CTL1_ACU_Msk             (0xful << EADC_M22CTL1_ACU_Pos)                   /*!< EADC_T::M22CTL1: ACU Mask              */

#define EADC_M22CTL1_EXTSTDIV_Pos        (16)                                              /*!< EADC_T::M22CTL1: EXTSTDIV Position     */
#define EADC_M22CTL1_EXTSTDIV_Msk        (0x3ul << EADC_M22CTL1_EXTSTDIV_Pos)              /*!< EADC_T::M22CTL1: EXTSTDIV Mask         */

#define EADC_M23CTL1_ALIGN_Pos           (0)                                               /*!< EADC_T::M23CTL1: ALIGN Position        */
#define EADC_M23CTL1_ALIGN_Msk           (0x1ul << EADC_M23CTL1_ALIGN_Pos)                 /*!< EADC_T::M23CTL1: ALIGN Mask            */

#define EADC_M23CTL1_AVG_Pos             (1)                                               /*!< EADC_T::M23CTL1: AVG Position          */
#define EADC_M23CTL1_AVG_Msk             (0x1ul << EADC_M23CTL1_AVG_Pos)                   /*!< EADC_T::M23CTL1: AVG Mask              */

#define EADC_M23CTL1_ACU_Pos             (4)                                               /*!< EADC_T::M23CTL1: ACU Position          */
#define EADC_M23CTL1_ACU_Msk             (0xful << EADC_M23CTL1_ACU_Pos)                   /*!< EADC_T::M23CTL1: ACU Mask              */

#define EADC_M23CTL1_EXTSTDIV_Pos        (16)                                              /*!< EADC_T::M23CTL1: EXTSTDIV Position     */
#define EADC_M23CTL1_EXTSTDIV_Msk        (0x3ul << EADC_M23CTL1_EXTSTDIV_Pos)              /*!< EADC_T::M23CTL1: EXTSTDIV Mask         */

#define EADC_M24CTL1_EXTSTDIV_Pos        (16)                                              /*!< EADC_T::M24CTL1: EXTSTDIV Position     */
#define EADC_M24CTL1_EXTSTDIV_Msk        (0x3ul << EADC_M24CTL1_EXTSTDIV_Pos)              /*!< EADC_T::M24CTL1: EXTSTDIV Mask         */

#define EADC_M25CTL1_EXTSTDIV_Pos        (16)                                              /*!< EADC_T::M25CTL1: EXTSTDIV Position     */
#define EADC_M25CTL1_EXTSTDIV_Msk        (0x3ul << EADC_M25CTL1_EXTSTDIV_Pos)              /*!< EADC_T::M25CTL1: EXTSTDIV Mask         */

#define EADC_M26CTL1_EXTSTDIV_Pos        (16)                                              /*!< EADC_T::M26CTL1: EXTSTDIV Position     */
#define EADC_M26CTL1_EXTSTDIV_Msk        (0x3ul << EADC_M26CTL1_EXTSTDIV_Pos)              /*!< EADC_T::M26CTL1: EXTSTDIV Mask         */

#define EADC_M27CTL1_EXTSTDIV_Pos        (16)                                              /*!< EADC_T::M27CTL1: EXTSTDIV Position     */
#define EADC_M27CTL1_EXTSTDIV_Msk        (0x3ul << EADC_M27CTL1_EXTSTDIV_Pos)              /*!< EADC_T::M27CTL1: EXTSTDIV Mask         */


/** @} EADC_CONST */
/** @} end of EADC register group */
/** @} end of REGISTER group */

#if defined ( __CC_ARM   )
    #pragma no_anon_unions
#endif

#endif /* __EADC_REG_H__ */
